{  
    "1": {  
        "name": "乾",  
        "hexagram": "☰☰",  
        "chinese_name": "乾为天",  
        "english_name": "The Creative",  
        "image": "乾：元，亨，利，贞。",  
        "judgment": "乾：元，亨，利，贞。",  
        "image_comment": "天行健，君子以自强不息。",  
        "lines": {  
            "初九": "初九：潜龙勿用。",  
            "九二": "九二：见龙在田，利见大人。",  
            "九三": "九三：君子终日乾乾，夕惕若，厉无咎。",  
            "九四": "九四：或跃在渊，干而窒；或跃在渊，自试也；见龙在田，利见大人。",  
            "九五": "九五：飞龙在天，利见大人。",  
            "上九": "上九：亢龙有悔。",  
            "用九": "用九：见群龙无首，吉。"  
        },  
        "interpretation": {  
            "fortune": "乾卦为纯阳之卦，象征天道运行，刚健自强。时运方面显示您当前处于积极向上的发展阶段，贵人运势强劲，事业和人际关系将迎来重要机遇。建议保持谦逊态度，积极进取但不可过于张扬。未来三个月内，可能有重要项目或合作机会出现，但需注意团队协作，避免独断专行。总体运势为大吉之象，宜把握时机，稳步前进。",  
            "wealth": "财运亨通，正财偏财皆有收获。乾卦主刚健之气，预示财务状况将呈现上升趋势，特别适合投资于长期稳定的项目。近期可能有意外之财或奖金收入，但需注意理财规划，避免冲动消费。建议制定详细的财务预算，关注股票、基金等稳健型投资机会。未来半年内，财运指数高达85分，宜开源节流，双管齐下。",  
            "career": "事业发展如日中天，领导欣赏，同事支持。乾卦象征创造力和领导力，预示您在职场中将获得重要晋升机会或项目主导权。建议加强专业技能学习，提升个人影响力。注意与上级沟通时保持谦虚态度，避免因成功而骄傲自满。未来一年内，职业发展前景光明，可能获得跨部门调动或重要职位提升。",  
            "marriage": "婚姻美满，夫妻恩爱和睦。乾卦为阳刚之象，显示夫妻关系中男方主导地位明显，但需注意情感沟通。单身者有望遇到条件优越、事业心强的对象，感情发展迅速。已婚者家庭生活稳定，子女运佳。建议多参与家庭活动，增进夫妻感情。未来两年内，婚姻运势指数80分，宜多包容理解，共同规划未来。",  
            "health": "身体状况良好，精力充沛，但需注意心血管系统健康。乾卦主刚强之气，预示您的体质强健，免疫力较高，但工作压力可能导致心脑血管负担加重。建议保持规律作息，每周进行3-4次有氧运动，如慢跑、游泳。注意饮食清淡，避免油腻食物。未来一年内，健康运势稳定，定期体检尤为重要，特别是血压和心脏检查。",  
            "lifespan": "寿命较长，晚年安康。乾卦象征天道循环，预示您具备良好的生命力和适应能力。建议从现在开始注重养生保健，保持乐观心态。60岁以后需特别关注心脑血管和骨骼健康，适当补充钙质和维生素。家庭和睦对延长寿命有积极作用。总体寿命预测在78-85岁之间，晚年生活质量较高，子女孝顺，生活富足。"  
        }  
    },  
    "2": {  
        "name": "坤",  
        "hexagram": "☷☷",  
        "chinese_name": "坤为地",  
        "english_name": "The Receptive",  
        "image": "坤：元，亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞吉。",  
        "judgment": "坤：元，亨，利牝马之贞。君子有攸往，先迷后得主，利西南得朋，东北丧朋。安贞吉。",  
        "image_comment": "地势坤，君子以厚德载物。",  
        "lines": {  
            "初六": "初六：履霜，坚冰至。",  
            "六二": "六二：直，方，大；不习无不利。",  
            "六三": "六三：含章可贞；或从王事，无成有终。",  
            "六四": "六四：括囊，无咎无誉。",  
            "六五": "六五：黄裳，元吉。",  
            "上六": "上六：龙战于野，其血玄黄。"  
        },  
        "interpretation": {  
            "fortune": "坤卦为纯阴之卦，象征大地承载，柔顺包容。时运方面显示您当前处于厚积薄发的阶段，表面平静但内在蕴藏巨大潜力。建议保持耐心和谦逊态度，时机成熟时自然水到渠成。未来半年内，宜多与志同道合之人合作，避免急于求成。总体运势平稳上升，宜静养蓄势，为重大突破做准备。",  
            "wealth": "财运稳定，利于储蓄和长期投资。坤卦主厚重之德，预示财务状况稳中有升，适合房地产、农业相关投资。近期可能有稳定的收入增长，但不宜冒险投资高风险项目。建议制定详细的财务规划，关注家庭开支控制。未来一年内，财运指数75分，宜守成为主，稳步积累财富。",  
            "career": "工作稳定，稳步发展。坤卦象征顺势而为，预示您在职场中将获得同事和上级的认可和支持。建议加强团队合作，发挥协调组织能力。注意工作节奏，避免过度劳累。未来一年内，职业发展平稳，可能获得稳定职位或部门内部晋升，适合从事教育、管理、农业相关行业。",  
            "marriage": "婚姻关系和谐稳定，家庭和睦。坤卦为阴柔之象，显示女性在家庭中扮演重要角色，善于持家。单身女性有望遇到成熟稳重、责任心强的对象。已婚者家庭生活温馨，子女孝顺。建议多关注伴侣的情感需求，增进沟通理解。未来两年内，婚姻运势良好，家庭幸福指数85分。",  
            "health": "身体状况平稳，但需注意脾胃和妇科健康。坤卦主土德，预示消化系统需特别关注。建议饮食规律，避免生冷油腻食物，多食五谷杂粮。适量进行瑜伽、太极等柔和运动，有助于调理身体。女性需定期进行妇科检查，关注月经调理。未来一年内，健康状况稳定，宜养生保健。",  
            "lifespan": "寿命中等偏上，晚年生活安稳。坤卦象征大地长久，预示您具备良好的耐力和适应能力。建议注重脾胃调养和情绪管理，避免过度忧虑。70岁以后需关注骨骼和关节健康，适当补充钙质。家庭和睦对健康长寿有积极影响。总体寿命预测在75-82岁，晚年生活平静富足。"  
        }  
    },  
    "3": {  
        "name": "屯",  
        "hexagram": "☵☳",  
        "chinese_name": "屯",  
        "english_name": "Difficulty at the Beginning",  
        "image": "屯：元，亨，利贞。勿用，有攸往，利建侯。",  
        "judgment": "屯：元，亨，利贞。勿用，有攸往，利建侯。",  
        "image_comment": "云行雨施，品物流形。",  
        "lines": {  
            "初九": "初九：磐桓，利居贞，利建侯。",  
            "六二": "六二：屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。",  
            "六三": "六三：即鹿无虞，惟入于林中，君子几不如舍，往吝。",  
            "六四": "六四：乘马班如，求婚媾，往吉，无不利。",  
            "九五": "九五：屯其膏，小贞吉，大贞凶。",  
            "上六": "上六：乘马班如，泣血涟如。"  
        },  
        "interpretation": {  
            "fortune": "屯卦象征初生艰难，事物开始阶段总有诸多困难和阻碍。时运方面显示您当前正处于创业或新项目的初期阶段，困难重重但蕴含巨大潜力。建议保持耐心和信心，稳步推进，不要急于求成。未来三个月内，宜多寻求贵人帮助，建立人脉网络。总体运势为小凶转大吉，关键在于坚持和智慧应对。",  
            "wealth": "财运波动，初期投资需谨慎。屯卦主艰难起步，预示财务状况暂时紧张，建议控制开支，避免大额投资。近期可能有意外支出，但长远来看有发展潜力。建议制定详细的预算计划，关注现金流管理。未来半年内，财运指数60分，宜开源节流，等待时机成熟再进行重大投资决策。",  
            "career": "工作面临挑战，需要耐心积累。屯卦象征初创困难，预示您在职场中可能遇到瓶颈或新任务的压力。建议加强专业技能学习，寻求导师指导。注意与同事的沟通，避免因误解产生矛盾。未来一年内，职业发展缓慢但有潜力，可能需要转换岗位或学习新技能，为长远发展奠定基础。",  
            "marriage": "感情发展缓慢，需耐心经营。屯卦主初生艰难，预示感情关系可能遇到沟通障碍或外界干扰。单身者不宜急于求成，宜静待时机。已婚者需注意夫妻间的理解和包容，避免因小事争吵。建议多创造浪漫氛围，增进感情交流。未来两年内，婚姻运势逐渐好转，宜以柔克刚，慢慢改善关系。",  
            "health": "身体状况一般，需注意劳逸结合。屯卦象征生长艰难，预示您的精力可能不足，容易疲劳。建议保持规律作息，避免熬夜，每日保证7-8小时睡眠。注意饮食均衡，多摄入富含维生素的食物。特别关注肝胆和泌尿系统健康，定期体检。未来一年内，健康运势一般，宜加强锻炼，提高身体抵抗力。",  
            "lifespan": "寿命中等，需要注意养生保健。屯卦主初生艰难，预示早年可能经历较多波折，但中年后逐渐稳定。建议从30岁开始注重健康管理，养成良好的生活习惯。60岁以后需特别关注心血管和消化系统健康，避免过度劳累。总体寿命预测在72-80岁，晚年生活相对平稳，需要子女的关心和陪伴。"  
        }  
    },  
    "4": {  
        "name": "蒙",  
        "hexagram": "☶☵",  
        "chinese_name": "蒙",  
        "english_name": "Youthful Folly",  
        "image": "蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",  
        "judgment": "蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",  
        "image_comment": "山下出泉，蒙；君子以果行育德。",  
        "lines": {  
            "初六": "初六：发蒙，利用刑人，用说桎梏，以往吝。",  
            "九二": "九二：包蒙，吉。纳妇，吉。子克家。",  
            "六三": "六三：勿用取女，见金夫，不有躬，无攸利。",  
            "六四": "六四：困蒙，吝。",  
            "六五": "六五：童蒙，吉。",  
            "上九": "上九：击蒙，不利为寇，利御寇。"  
        },  
        "interpretation": {  
            "fortune": "蒙卦象征蒙昧初开，学习求知。时运方面显示您当前处于知识积累和经验学习的重要阶段，宜虚心求教，广泛学习。建议多阅读专业书籍，参加培训课程，向有经验的前辈请教。未来半年内，学习运势极佳，可能获得重要导师的指导。总体运势为大吉之象，关键在于保持学习热情和谦虚态度。",  
            "wealth": "财运平稳，利于知识型投资。蒙卦主学习求知，预示通过学习新技能或知识将带来财务上的长远收益。近期不宜进行高风险投资，建议投资于教育、培训或技能提升。未来一年内，财运指数70分，宜通过自我提升增加收入来源，避免盲目跟风投资热门项目。",  
            "career": "职业发展需要学习和积累。蒙卦象征启蒙教育，预示您在职场中需要不断学习新知识和技能。建议制定职业发展规划，参加行业培训或获得相关证书。注意与同事和上级的沟通，保持谦虚好学的态度。未来一年内，职业运势向好，可能获得晋升机会或重要项目参与权。",  
            "marriage": "感情关系需要沟通和理解。蒙卦主启蒙开化，预示感情中可能存在误解或沟通不畅。单身者宜多参加社交活动，扩大交友圈。已婚者需注意夫妻间的沟通，避免因误会产生隔阂。建议坦诚相待，增进相互理解。未来两年内，婚姻运势逐渐改善，宜多创造共同话题和兴趣爱好。",  
            "health": "身体状况良好，但需注意眼部和神经系统。蒙卦象征开智启蒙，预示精神状态活跃但可能导致用眼过度。建议每工作1小时休息10分钟，保持良好的阅读习惯。注意饮食均衡，避免辛辣刺激性食物。多进行户外活动，缓解眼部疲劳。未来一年内，健康运势稳定，宜保持良好作息。",  
            "lifespan": "寿命较长，晚年智慧充沛。蒙卦主学习求知，预示您具备良好的学习能力和适应能力，有助于健康长寿。建议保持终身学习的态度，保持大脑活跃。60岁以后可学习书法、绘画等艺术活动，预防老年痴呆。总体寿命预测在78-85岁，晚年生活充实，精神状态良好。"  
        }  
    },  
    "5": {  
        "name": "需",  
        "hexagram": "☰☵",  
        "chinese_name": "需",  
        "english_name": "Waiting",  
        "image": "需：有孚，光亨，贞吉。利涉大川。",  
        "judgment": "需：有孚，光亨，贞吉。利涉大川。",  
        "image_comment": "云上于天，需；君子以饮食宴乐。",  
        "lines": {  
            "初九": "初九：需于郊，利用恒，无咎。",  
            "九二": "九二：需于沙，小有言，终吉。",  
            "九三": "九三：需于泥，致寇至。",  
            "六四": "六四：需于血，出自穴。",  
            "九五": "九五：需于酒食，贞吉。",  
            "上六": "上六：入于穴，有不速之客三人来，敬之终吉。"  
        },  
        "interpretation": {  
            "fortune": "需卦象征等待时机，耐心蓄势。时运方面显示您当前正处于关键的等待阶段，不宜急进，宜静待时机成熟。建议保持乐观心态，积极准备，为即将到来的机会做好充分准备。未来三个月内，时机逐渐成熟，可能有重要机遇降临。总体运势为中吉之象，关键在于耐心和充分准备。",  
            "wealth": "财运平稳，宜等待投资时机。需卦主等待时机，预示当前不宜进行大额投资，建议观察市场动向，等待最佳入市时机。近期可能有稳定的收入来源，但增长缓慢。建议做好资金储备，关注长期投资机会。未来半年内，财运指数65分，宜以守为主，伺机而动。",  
            "career": "工作进展缓慢，需要耐心等待。需卦象征等待时机，预示您在职场中可能处于观望或准备阶段。建议利用这段时间提升专业技能，做好项目规划。注意与同事的沟通，避免因等待而产生焦虑。未来一年内，职业运势逐渐好转，可能获得重要任务或职位调整。",  
            "marriage": "感情关系稳定，需要耐心经营。需卦主等待时机，预示感情发展需要时间和耐心。单身者不宜急于求成，宜自然发展。已婚者家庭生活平静，宜多关心伴侣的需求。建议创造浪漫氛围，增进感情交流。未来两年内，婚姻运势平稳向上，宜以诚相待，慢慢培养感情。",  
            "health": "身体状况良好，但需注意休息。需卦象征等待蓄养，预示您的体质稳定，但工作压力可能导致疲劳。建议保持规律作息，保证充足睡眠。注意饮食均衡，避免过度劳累。多进行放松活动，如听音乐、散步等。未来一年内，健康运势良好，宜劳逸结合，保持身心平衡。",  
            "lifespan": "寿命中等偏上，晚年安稳。需卦主等待时机，预示您具备良好的耐力和适应能力。建议保持平和心态，避免急躁和焦虑。60岁以后需注意心血管健康，适当进行有氧运动。家庭和谐对健康长寿有积极作用。总体寿命预测在75-82岁，晚年生活平静，需要适当的养生保健。"  
        }  
    },  
    "6": {  
        "name": "讼",  
        "hexagram": "☵☰",  
        "chinese_name": "讼",  
        "english_name": "Conflict",  
        "image": "讼：有孚窒，惕中吉，终凶。利见大人，不利涉大川。",  
        "judgment": "讼：有孚窒，惕中吉，终凶。利见大人，不利涉大川。",  
        "image_comment": "讼：有孚窒，惕中吉，终凶。利见大人，不利涉大川。",  
        "lines": {  
            "初六": "初六：不永所事，小有言，终吉。",  
            "九二": "九二：不克讼，归而逋，其邑人三百户，无眚。",  
            "六三": "六三：食旧德，贞厉，终吉；或从王事，无成。",  
            "九四": "九四：不克讼，复即命渝，安贞吉。",  
            "九五": "九五：讼元吉。",  
            "上九": "上九：或锡之鞶带，终朝三褫之。"  
        },  
        "interpretation": {  
            "fortune": "讼卦象征争讼纠葛，人际冲突。时运方面显示您当前可能面临口舌是非或利益纠纷，建议以和为贵，避免正面冲突。宜寻求第三方调解，保持冷静态度。未来三个月内，矛盾可能加剧，但若能妥善处理，将化险为夷。总体运势为小凶，关键在于忍让和智慧化解，不要逞一时之快。",  
            "wealth": "财运受阻，可能有经济纠纷。讼卦主争讼，预示财务方面可能出现合同纠纷或投资争议。建议仔细审查所有财务文件，避免口头协议。近期不宜进行大额借贷或投资，注意保护个人财产。未来半年内，财运指数55分，宜谨慎理财，咨询专业人士，避免因争执造成经济损失。",  
            "career": "工作中有矛盾冲突，需要注意人际关系。讼卦象征争端，预示职场中可能出现同事间的矛盾或与上级的误解。建议保持低调，避免卷入办公室政治。多倾听他人意见，寻求共识解决分歧。未来一年内，职业运势波动，可能需要调解团队矛盾或处理工作纠纷。",  
            "marriage": "夫妻间可能有误会争执，需要沟通。讼卦主争讼，预示感情关系中可能出现沟通不畅或小矛盾。建议避免因小事争吵，保持冷静和包容。单身者需注意言辞，避免因误会导致感情破裂。已婚者宜坦诚相待，增进相互理解。未来两年内，婚姻运势需谨慎处理，避免小事酿成大祸。",  
            "health": "注意情绪管理和呼吸系统健康。讼卦象征争执，预示心理压力较大，容易焦虑烦躁。建议学习情绪管理技巧，如冥想、深呼吸等。注意呼吸道健康，避免感冒和过敏。保持规律作息，避免熬夜。多进行户外活动，缓解精神压力。未来一年内，健康运势一般，宜保持乐观心态。",  
            "lifespan": "寿命中等，需要注意情绪健康。讼卦主争讼纠葛，预示生活中的矛盾和压力可能影响健康。建议学会情绪管理，保持平和心态。60岁以后需特别关注心血管和呼吸系统健康，避免因争执而影响身体。总体寿命预测在70-78岁，晚年生活需保持平静，避免家庭矛盾对健康造成影响。"  
        }  
    },  
    "7": {  
        "name": "师",  
        "hexagram": "☷☵",  
        "chinese_name": "师",  
        "english_name": "The Army",  
        "image": "师：贞丈人吉，无咎。",  
        "judgment": "师：贞丈人吉，无咎。",  
        "image_comment": "地中有水，师；君子以容民畜众。",  
        "lines": {  
            "初六": "初六：师出以律，否臧凶。",  
            "九二": "九二：在师中，吉，无咎，王三锡命。",  
            "六三": "六三：师或舆尸，凶。",  
            "六四": "六四：师左次，无咎。",  
            "六五": "六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",  
            "上六": "上六：大君有命，开国承家，小人勿用。"  
        },  
        "interpretation": {  
            "fortune": "师卦象征统御军队，领导管理。时运方面显示您当前需要承担领导责任或团队管理任务，建议制定明确计划，严格执行。宜发挥组织协调能力，凝聚团队力量。未来三个月内，可能有重要项目需要您主导。总体运势为中吉之象，关键在于公正严明，赏罚分明，才能获得成功。",  
            "wealth": "财运稳定，利于团队合作投资。师卦主统御管理，预示通过团队协作将获得财务收益。建议参与合伙经营或团队项目，避免单打独斗。近期可能有稳定的合作收入，但需注意合同条款。未来半年内，财运指数70分，宜发挥管理才能，带领团队共同发展。",  
            "career": "事业发展顺利，领导能力得到认可。师卦象征统帅，预示您在职场中将承担重要管理职责。建议加强领导艺术学习，注重团队建设。注意公正处理下属事务，避免偏私。未来一年内，职业运势良好，可能获得晋升或重要项目负责人职位，管理才能将得到充分展现。",  
            "marriage": "家庭关系和谐，夫妻共同管理家务。师卦主统御，预示家庭中需要明确分工，共同承担责任。单身者有望遇到事业心强、有领导才能的对象。已婚者家庭生活稳定，子女教育需共同参与。建议夫妻间加强沟通，共同规划家庭未来。未来两年内，婚姻运势良好，家庭和睦。",  
            "health": "身体状况良好，但需注意腰背健康。师卦象征重任在肩，预示工作压力可能导致腰背肌肉劳损。建议保持正确坐姿，避免长时间伏案工作。每小时起身活动5-10分钟。注意饮食均衡，多摄入富含钙质的食物。未来一年内，健康运势稳定，宜加强腰背锻炼，如游泳、瑜伽等。",  
            "lifespan": "寿命较长，晚年生活富足。师卦主领导管理，预示您具备较强的组织能力和应变能力，有助于健康长寿。建议保持积极的生活态度，注重团队和家庭关系。60岁以后可担任社区或家族中的协调角色，保持社会活跃度。总体寿命预测在78-85岁，晚年生活有声有色。"  
        }  
    },  
    "8": {  
        "name": "比",  
        "hexagram": "☵☷",  
        "chinese_name": "比",  
        "english_name": "Holding Together",  
        "image": "比：吉，原筮元永贞，无咎。不宁方来，后夫凶。",  
        "judgment": "比：吉，原筮元永贞，无咎。不宁方来，后夫凶。",  
        "image_comment": "地上有水，比；先王以建万国，亲诸侯。",  
        "lines": {  
            "初六": "初六：有孚比之，无咎。有孚盈缶，终来有它，吉。",  
            "六二": "六二：比之自内，贞吉。",  
            "六三": "六三：比之匪人。",  
            "六四": "六四：外比之，贞吉。",  
            "九五": "九五：显比，王用三驱，失前禽，邑人不诫，吉。",  
            "上六": "上六：比之无首，凶。"  
        },  
        "interpretation": {  
            "fortune": "比卦象征亲比团结，合作共事。时运方面显示您当前需要加强人际关系，建立合作联盟。建议主动结交志同道合之人，扩大社交圈子。未来三个月内，合作机会增多，可能有重要合伙关系建立。总体运势为大吉之象，关键在于真诚相待，互利共赢，才能获得长久发展。",  
            "wealth": "财运良好，利于合伙经营。比卦主亲比合作，预示通过团队协作和合伙关系将获得丰厚回报。建议寻找可靠的合作伙伴，共同开发项目。近期可能有合作投资的机会，但需注意利益分配。未来半年内，财运指数80分，宜发挥协调能力，促成共赢合作。",  
            "career": "工作顺利，团队合作得力。比卦象征团结协作，预示您在职场中将获得同事和团队的强力支持。建议加强团队建设，发挥协调组织能力。注意公平处理团队事务，避免偏私。未来一年内，职业运势极佳，可能获得团队项目成功或集体荣誉，个人声望提升。",  
            "marriage": "感情关系和谐，夫妻和睦。比卦主亲密关系，预示夫妻感情深厚，相互扶持。单身者有望遇到温柔体贴、善于沟通的对象。已婚者家庭生活幸福，宜共同规划未来。建议多参与社交活动，扩大朋友圈子。未来两年内，婚姻运势美满，家庭幸福指数90分。",  
            "health": "身体状况良好，精神愉快。比卦象征和谐共处，预示心理状态稳定，人际关系良好对健康有积极影响。建议多参加集体活动，如登山、聚会等。注意饮食卫生，避免传染病。保持良好心态，适当进行团体运动。未来一年内，健康运势良好，宜保持乐观积极的态度。",  
            "lifespan": "寿命较长，晚年生活幸福。比卦主亲比和睦，预示您具备良好的社交能力和人缘，有助于健康长寿。建议保持广泛的社交网络，参与社区活动。60岁以后可担任家庭或社区中的协调角色，保持生活充实。总体寿命预测在80-88岁，晚年生活丰富多彩，朋友众多。"  
        }  
    },  
    "9": {  
        "name": "小畜",  
        "hexagram": "☴☰",  
        "chinese_name": "小畜",  
        "english_name": "The Taming Power of the Small",  
        "image": "小畜：亨。密云不雨，自我西郊。",  
        "judgment": "小畜：亨。密云不雨，自我西郊。",  
        "image_comment": "风行天上，小畜；君子以懿文德。",  
        "lines": {  
            "初九": "初九：复自道，何其咎，吉。",  
            "九二": "九二：牵复，吉。",  
            "九三": "九三：舆说輹，夫妻反目。",  
            "六四": "六四：有孚，血去惕出，无咎。",  
            "九五": "九五：有孚挛如，富以其邻。",  
            "上九": "上九：既雨既处，尚德载，妇贞厉。月几望，君子征凶。"  
        },  
        "interpretation": {  
            "fortune": "小畜卦象征小有蓄积，稳步积累。时运方面显示您当前处于小有成就但尚未大成的阶段，建议脚踏实地，稳步前进。宜注重细节管理，积累小胜为大胜。未来三个月内，进展缓慢但稳定，可能有小项目成功。总体运势为中吉，关键在于持之以恒，积少成多，不要急于求成。",  
            "wealth": "财运平稳，小有收益。畜卦主蓄积，预示财务状况稳定增长，适合小额投资和储蓄。近期可能有额外收入，但金额不大。建议制定详细的理财计划，关注日常开支控制。未来半年内，财运指数68分，宜小步积累，避免高风险投资，稳步增加财富。",  
            "career": "工作进展缓慢，需要耐心积累。小畜卦象征小有蓄养，预示职业发展需要时间和积累。建议专注当前任务，完善专业技能。注意工作细节，避免因小失大。未来一年内，职业运势稳定，可能获得小幅晋升或项目小成，需继续努力，为大发展做准备。",  
            "marriage": "感情关系稳定，但进展缓慢。小畜卦主小有蓄养，预示感情需要慢慢培养。单身者不宜急于求成，宜自然发展。已婚者家庭生活平淡，需创造小惊喜增进感情。建议多关注日常小事，积累感情基础。未来两年内，婚姻运势平稳，宜细水长流，慢慢培养深厚感情。",  
            "health": "身体状况一般，需注意休息调养。小畜卦象征蓄养，预示精力需要补充和恢复。建议保证充足睡眠，避免过度劳累。注意饮食均衡，多食滋补食物。适当进行轻度运动，如散步、瑜伽等。未来一年内，健康运势稳定，宜劳逸结合，逐步恢复精力。",  
            "lifespan": "寿命中等，晚年生活平稳。小畜卦主小有蓄积，预示生活积累稳健但不突出。建议保持良好的生活习惯，注重日常养生。60岁以后需关注慢性病防治，保持适度运动。总体寿命预测在73-80岁，晚年生活平静，需要持续的健康管理。"  
        }  
    },  
    "10": {  
        "name": "履",  
        "hexagram": "☱☰",  
        "chinese_name": "履",  
        "english_name": "Treading",  
        "image": "履：履虎尾，不咥人，亨。",  
        "judgment": "履：履虎尾，不咥人，亨。",  
        "image_comment": "履：上天下泽，履；君子以辨上下，定民志。",  
        "lines": {  
            "初九": "初九：素履，往无咎。",  
            "九二": "九二：履道坦坦，幽人贞吉。",  
            "六三": "六三：眇能视，跛能履，履虎尾，咥人，凶。武人为于大君。",  
            "九四": "九四：履虎尾，愬愬，终吉。",  
            "九五": "九五：夬履，贞厉。",  
            "上九": "上九：视履考祥，其旋元吉。"  
        },  
        "interpretation": {  
            "fortune": "履卦象征谨慎行事，如履薄冰。时运方面显示您当前需要小心谨慎，特别是在人际交往和决策方面。建议深思熟虑，避免冲动行事。未来三个月内，环境复杂，需要灵活应对。总体运势为中吉，关键在于审时度势，保持谦虚谨慎的态度，才能化险为夷，获得成功。",  
            "wealth": "财运一般，需要谨慎理财。履卦主谨慎小心，预示财务决策需三思而后行。建议避免高风险投资，关注稳健理财产品。近期可能有小额收益，但需注意合同细节。未来半年内，财运指数62分，宜保守理财，避免因贪心导致损失。",  
            "career": "工作需要谨慎处理人际关系。履卦象征小心行事，预示职场环境中可能存在复杂的人际关系。建议保持低调，避免卷入是非。多倾听他人意见，灵活处理工作矛盾。未来一年内，职业运势平稳，需要注意与上级和同事的沟通技巧，逐步建立信任关系。",  
            "marriage": "感情关系需要小心维护。履卦主谨慎相处，预示感情中需要注意言行，避免因小事引起误会。单身者宜低调交往，不要急于表白。已婚者需注意夫妻沟通，避免冷战。建议以柔和态度处理感情问题，多体谅对方。未来两年内，婚姻运势需谨慎经营。",  
            "health": "身体状况一般，需注意足部和神经健康。履卦象征行走谨慎，预示可能存在足部不适或神经紧张。建议穿舒适鞋子，避免长时间站立。注意保持良好姿势，缓解颈椎和腰椎压力。适当进行足部按摩和放松运动。未来一年内，健康运势稳定，宜注意日常小节。",  
            "lifespan": "寿命中等，需要注意安全健康。履卦主谨慎行事，预示生活需要注意安全防范。建议养成良好的安全习惯，避免冒险行为。60岁以后需特别关注骨骼和关节健康，保持适度运动。总体寿命预测在72-79岁，晚年生活需要谨慎养生。"  
        }  
    },  
    "11": {  
        "name": "泰",  
        "hexagram": "☷☰",  
        "chinese_name": "泰",  
        "english_name": "Peace",  
        "image": "泰：小往大来，吉，亨。",  
        "judgment": "泰：小往大来，吉，亨。",  
        "image_comment": "天地交，泰；后以财成天地之道，辅相天地之宜，与时消息。",  
        "lines": {  
            "初九": "初九：拔茅茹，以其汇。征吉。",  
            "九二": "九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。",  
            "九三": "九三：无平不陂，无往不复。艰贞无咎。勿恤其孚，于食有福。",  
            "六四": "六四：翩翩，不富以其邻，不戒以孚。",  
            "六五": "六五：帝乙归妹，以祉元吉。",  
            "上六": "上六：城复于隍，勿用师。自邑告命，贞吝。"  
        },  
        "interpretation": {  
            "fortune": "泰卦象征天地交泰，通达顺畅。时运方面显示您当前处于人生顺遂、事事如意的黄金时期，贵人运势强劲，机遇不断。建议抓住时机，大胆进取，积极拓展事业和人脉。未来半年内，运势极佳，可能获得重大突破或重要合作。总体运势为大吉大利，宜积极行动，乘胜追击。",  
            "wealth": "财运旺盛，正财偏财双丰收。泰卦主通达顺畅，预示财务状况大幅提升，可能有意外之财或投资回报。建议适度扩大投资规模，关注房地产、股票等机会。近期可能获得奖金或额外收入。未来一年内，财运指数90分，宜大胆投资，但注意风险控制，稳中求进。",  
            "career": "事业蒸蒸日上，领导赏识。泰卦象征顺利发展，预示您在职场中将获得重要晋升或项目成功。建议大胆展现个人能力，积极争取领导关注。团队合作顺利，同事关系融洽。未来一年内，职业运势极佳，可能获得跨部门调动、高层职位或重要项目主导权。",  
            "marriage": "婚姻美满，家庭和睦幸福。泰卦主天地交合，预示夫妻感情深厚，家庭生活温馨美满。单身者有望遇到理想伴侣，感情发展迅速。已婚者家庭经济改善，子女学业有成。建议多组织家庭活动，增进亲子关系。未来两年内，婚姻运势极佳，家庭幸福指数95分。",  
            "health": "身体状况极佳，精力充沛。泰卦象征和谐通畅，预示免疫力强，疾病少有。建议保持现有良好生活习惯，继续进行规律运动。注意预防感冒，避免过度劳累。心理状态乐观，抗压能力强。未来一年内，健康运势极好，宜保持良好心态，继续健康生活方式。",  
            "lifespan": "寿命长久，晚年富贵安康。泰卦主通达顺遂，预示您具备极佳的生命力和适应能力。建议保持积极乐观的生活态度，注重养生保健。60岁以后身体状况良好，可继续适度社会活动。家庭和睦，子女孝顺。总体寿命预测在82-90岁，晚年生活质量极高，福寿双全。"  
        }  
    },  
    "12": {  
        "name": "否",  
        "hexagram": "☰☷",  
        "chinese_name": "否",  
        "english_name": "Standstill",  
        "image": "否：否之匪人，不利君子贞，大往小来。",  
        "judgment": "否：否之匪人，不利君子贞，大往小来。",  
        "image_comment": "天地不交，否；君子以俭德避难，不可荣以禄。",  
        "lines": {  
            "初六": "初六：拔茅茹，以其汇。贞吉，亨。",  
            "六二": "六二：包承，小人吉，大人否，亨。",  
            "六三": "六三：包羞。",  
            "九四": "九四：有命，无咎，畴离祉。",  
            "九五": "九五：休否，大人吉。其亡其亡，系于苞桑。",  
            "上九": "上九：倾否，先否后喜。"  
        },  
        "interpretation": {  
            "fortune": "否卦象征闭塞不通，事事不顺。时运方面显示您当前处于低谷期，事业和人际关系可能遇到严重阻碍。建议保持冷静，审时度势，避免盲目行动。未来三个月内，环境恶劣，需要韬光养晦。总体运势为大凶，关键在于忍耐和等待，积蓄力量，等待时机转变，不要强求。",  
            "wealth": "财运低迷，需谨慎理财。否卦主闭塞不通，预示财务状况恶化，可能出现亏损或资金周转困难。建议严格控制开支，暂停一切投资计划。近期避免借贷和担保，保护现有资产。未来半年内，财运指数40分，宜开源节流，度过难关，等待经济复苏。",  
            "career": "工作停滞不前，发展受阻。否卦象征闭塞，预示职场中可能面临裁员、降职或项目失败。建议保持低调，避免与上级冲突。利用这段时间学习新技能，为未来发展做准备。未来一年内，职业运势低迷，需要耐心等待，可能需要转换行业或岗位。",  
            "marriage": "感情关系紧张，易有矛盾。否卦主不通顺畅，预示夫妻关系冷淡，可能出现严重争执。单身者感情运极差，不宜结婚或订婚。已婚者需注意沟通，避免离婚危机。建议寻求婚姻咨询，改善夫妻关系。未来两年内，婚姻运势低谷，需要双方共同努力修复感情。",  
            "health": "身体状况不佳，需注意慢性病。否卦象征闭塞，预示可能出现健康问题，特别是心血管和消化系统。建议定期体检，保持良好作息。避免过度焦虑，保持乐观心态。多进行适度运动，增强体质。未来一年内，健康运势较差，宜重视养生，预防疾病恶化。",  
            "lifespan": "寿命受影响，需要注意健康管理。否卦主闭塞不通，预示当前生活压力可能对健康造成负面影响。建议调整生活方式，减轻心理负担。60岁以前需特别注意心脑血管健康，避免过度劳累。总体寿命预测在68-75岁，晚年生活需加强健康管理，保持良好心态。"  
        }  
    },  
    "13": {  
        "name": "同人",  
        "hexagram": "☰☲",  
        "chinese_name": "同人",  
        "english_name": "Fellowship with Men",  
        "image": "同人：同人于野，亨。利涉大川，利君子贞。",  
        "judgment": "同人：同人于野，亨。利涉大川，利君子贞。",  
        "image_comment": "天与火，同人；君子以类族辨物。",  
        "lines": {  
            "初九": "初九：同人于门，无咎。",  
            "六二": "六二：同人于宗，吝。",  
            "九三": "九三：伏戎于莽，升其高陵，三岁不兴。",  
            "九四": "九四：乘其墉，弗克攻，吉。",  
            "九五": "九五：同人，先号咷而后笑。大师克相遇。",  
            "上九": "上九：同人于郊，无悔。"  
        },  
        "interpretation": {  
            "fortune": "同人卦象征志同道合，广泛结交。时运方面显示您当前人缘极佳，贵人运旺盛，适合拓展人脉，建立合作关系。建议积极参加社交活动，结交有益朋友。未来半年内，合作机会众多，可能结识重要合作伙伴。总体运势为大吉，关键在于真诚待人，广结善缘，共同发展。",  
            "wealth": "财运亨通，利于合伙经营。同人卦主广泛交往，预示通过人脉关系将获得丰厚财运。建议积极寻找商业合作伙伴，共同开发项目。近期可能有合作投资的良好机会。未来一年内，财运指数85分，宜发挥社交优势，促成多方共赢的商业合作。",  
            "career": "工作顺利，团队合作得力。同人卦象征志同道合，预示您在职场中将获得广泛支持和合作。建议加强团队建设，积极参与跨部门合作。领导赏识度高，同事关系融洽。未来一年内，职业运势极佳，可能获得重要项目团队领导职位或集体荣誉奖励。",  
            "marriage": "感情发展顺利，人缘极佳。同人卦主广泛交往，预示单身者桃花运旺，容易遇到合适对象。已婚者家庭关系和谐，夫妻感情良好。建议多参加社交活动，扩大交友圈。未来两年内，婚姻运势美满，感情发展顺畅，家庭幸福指数88分。",  
            "health": "身体状况良好，精神愉快。同人卦象征和谐共处，预示心理状态乐观，人际关系对健康有积极影响。建议多参加集体活动，保持良好社交生活。注意饮食卫生，避免传染病。适当进行团体运动，增强体质。未来一年内，健康运势良好，宜保持积极心态。",  
            "lifespan": "寿命较长，晚年生活丰富多彩。同人卦主广泛交往，预示您具备优秀的人际关系和社交能力，有助于健康长寿。建议保持活跃的社交生活，参与社区活动。60岁以后可担任社交协调角色，保持生活充实。总体寿命预测在80-87岁，晚年朋友众多，生活幸福。"  
        }  
    },  
    "14": {  
        "name": "大有",  
        "hexagram": "☲☰",  
        "chinese_name": "大有",  
        "english_name": "Possession in Great Measure",  
        "image": "大有：元，亨。",  
        "judgment": "大有：元，亨。",  
        "image_comment": "火在天上，大有；君子以遏恶扬善，顺天休命。",  
        "lines": {  
            "初九": "初九：无交害，匪咎，艰则无咎。",  
            "九二": "九二：大车以载，有攸往，无咎。",  
            "九三": "九三：公用亨于天子，小人弗克。",  
            "九四": "九四：匪其彭，无咎。",  
            "六五": "六五：厥孚交如，威如，吉。",  
            "上九": "上九：自天祐之，吉无不利。"  
        },  
        "interpretation": {  
            "fortune": "大有卦象征大有所得，丰收富足。时运方面显示您当前处于人生巅峰，事业有成，名利双收。建议保持谦虚谨慎，继续努力发展。未来半年内，机遇不断，贵人相助。总体运势为大吉大利，宜乘胜追击，扩大事业版图，但需注意分享成功，避免独享。",  
            "wealth": "财运极佳，财富大幅增长。大有卦主丰盛富足，预示正财偏财双丰收，可能获得大额奖金、投资回报或遗产。建议合理规划财富，适度投资多元化项目。近期财运旺盛，宜大胆拓展业务。未来一年内，财运指数95分，财富积累达到新高峰。",  
            "career": "事业辉煌，名声远播。大有卦象征大有所成，预示您在职场中将获得重大成功和认可。领导器重，团队敬服，可能获得行业奖项或重要荣誉。建议继续保持高标准工作，带领团队创新发展。未来一年内，职业巅峰期，宜把握机会，创造更大成就。",  
            "marriage": "婚姻美满，家庭富足幸福。大有卦主丰盛，预示家庭经济状况极佳，夫妻感情深厚。单身者有望遇到经济条件优越的对象。已婚者家庭生活奢华，子女教育无忧。建议合理规划家庭财富，增进夫妻感情。未来两年内，婚姻运势极佳，家庭幸福指数92分。",  
            "health": "身体状况极佳，精力充沛。大有卦象征丰盛，预示体质强健，免疫力高。建议保持现有健康习惯，继续规律运动和均衡饮食。心理状态自信乐观，抗压能力强。注意预防过度劳累导致的小病。未来一年内，健康运势极好，宜保持良好生活方式。",  
            "lifespan": "寿命长久，晚年富贵安康。大有卦主丰盛富足，预示您具备极佳的生命力和经济基础，有助于健康长寿。建议保持积极心态，继续养生保健。60岁以后经济宽裕，可享受高品质医疗服务。总体寿命预测在85-92岁，晚年生活奢华富足，福寿绵长。"  
        }  
    },  
    "15": {  
        "name": "谦",  
        "hexagram": "☷☶",  
        "chinese_name": "谦",  
        "english_name": "Modesty",  
        "image": "谦：亨，君子有终。",  
        "judgment": "谦：亨，君子有终。",  
        "image_comment": "地中有山，谦；君子以裒多益寡，称物平施。",  
        "lines": {  
            "初六": "初六：谦谦君子，用涉大川，吉。",  
            "六二": "六二：鸣谦，贞吉。",  
            "九三": "九三：劳谦君子，有终，吉。",  
            "六四": "六四：无不利，撝谦。",  
            "六五": "六五：不富以其邻，利用侵伐，无不利。",  
            "上六": "上六：鸣谦，利用行师，征邑国。"  
        },  
        "interpretation": {  
            "fortune": "谦卦象征谦虚谨慎，低调行事。时运方面显示您当前需要保持谦虚态度，避免骄傲自满。建议虚心纳谏，广泛听取他人意见。未来半年内，谦虚态度将为您赢得更多支持和机会。总体运势为大吉，关键在于戒骄戒躁，保持谦逊，才能获得长久成功和发展。",  
            "wealth": "财运稳定，利于低调理财。谦卦主谦虚低调，预示财务状况平稳发展，不宜炫富。建议保守理财，避免高调投资。近期可能有稳定收入增长，但需注意税务规划。未来一年内，财运指数75分，宜低调积累财富，稳步提升财务状况。",  
            "career": "工作顺利，领导欣赏谦虚态度。谦卦象征谦逊有礼，预示您在职场中将因谦虚谨慎而获得上级青睐。建议保持低调工作态度，积极承担责任。团队合作融洽，同事关系良好。未来一年内，职业运势良好，可能获得稳步晋升或重要任务委派。",  
            "marriage": "家庭关系和谐，夫妻互相尊重。谦卦主谦让有礼，预示婚姻关系中需要互相尊重和包容。单身者宜展现谦虚的一面，更易获得好感。已婚者家庭生活温馨，宜互相体谅。建议避免争强好胜，多做让步。未来两年内，婚姻运势良好，家庭和睦。",  
            "health": "身体状况良好，精神平和。谦卦象征谦和有礼，预示心理状态稳定，压力较小。建议保持良好心态，继续规律运动。注意饮食清淡，避免过度饮食。适当进行放松活动，如冥想、瑜伽等。未来一年内，健康运势稳定，宜保持平和心态。",  
            "lifespan": "寿命较长，晚年生活安宁。谦卦主谦虚有礼，预示您具备良好的处世态度和人际关系，有助于健康长寿。建议保持谦和的心态，避免争强好胜。60岁以后可担任调解协调角色，保持社会和谐。总体寿命预测在78-85岁，晚年生活平静幸福。"  
        }  
    },  
    "16": {  
        "name": "豫",  
        "hexagram": "☳☷",  
        "chinese_name": "豫",  
        "english_name": "Enthusiasm",  
        "image": "豫：利建侯行师。",  
        "judgment": "豫：利建侯行师。",  
        "image_comment": "雷出地奋，豫；先王以作乐崇德，殷荐之上帝，以配祖考。",  
        "lines": {  
            "初六": "初六：鸣豫，凶。",  
            "六二": "六二：介于石，不终日，贞吉。",  
            "六三": "六三：盱豫，有悔，迟有悔。",  
            "九四": "九四：由豫，大有得，勿疑，朋盍簪。",  
            "六五": "六五：贞疾，恒不死。",  
            "上六": "上六：冥豫，成有渝，无咎。"  
        },  
        "interpretation": {  
            "fortune": "豫卦象征愉悦喜乐，积极乐观。时运方面显示您当前处于轻松愉快的阶段，适合娱乐放松和社交活动。建议保持积极心态，积极参与各种活动。未来半年内，人缘极佳，生活愉快。总体运势为大吉，关键在于保持乐观态度，享受生活，但不要过度放纵。",  
            "wealth": "财运良好，利于娱乐消费。豫卦主喜乐愉悦，预示财务状况宽裕，适合适度娱乐消费。近期可能有额外收入用于休闲娱乐。建议合理规划娱乐预算，避免过度消费。未来一年内，财运指数78分，生活富足，宜享受生活但注意节制。",  
            "career": "工作轻松愉快，团队氛围好。豫卦象征喜乐，预示职场环境融洽，工作压力小。建议积极参与团队活动，增强同事关系。领导赏识您的乐观态度。未来一年内，职业运势良好，可能获得轻松愉快的项目或团队合作机会。",  
            "marriage": "感情甜蜜，生活浪漫。豫卦主喜乐，预示夫妻感情甜蜜，家庭生活幸福。单身者桃花运旺，容易遇到有趣的对象。已婚者生活浪漫，宜多创造惊喜。建议多安排约会和旅行，增进感情。未来两年内，婚姻运势极佳，浪漫幸福指数90分。",  
            "health": "身体状况良好，精神愉快。豫卦象征喜乐，预示心理状态极佳，免疫力强。建议保持积极生活态度，适当进行娱乐运动。注意饮食规律，避免暴饮暴食。保持良好睡眠，享受生活乐趣。未来一年内，健康运势极好，宜保持乐观心态。",  
            "lifespan": "寿命较长，晚年生活快乐。豫卦主喜乐乐观，预示您具备积极的心态和生活态度，有助于健康长寿。建议保持乐观的生活方式，享受各种兴趣爱好。60岁以后可学习音乐、舞蹈等艺术活动，保持活力。总体寿命预测在80-87岁，晚年生活丰富多彩。"  
        }  
    },  
    "17": {  
        "name": "随",  
        "hexagram": "☱☵",  
        "chinese_name": "随",  
        "english_name": "Following",  
        "image": "随：元，亨，利贞，无咎。",  
        "judgment": "随：元，亨，利贞，无咎。",  
        "image_comment": "泽中有雷，随；君子以舌取众。",  
        "lines": {  
            "初九": "初九：官有渝，贞吉。出门交有功。",  
            "六二": "六二：系小子，失丈夫。",  
            "六三": "六三：系丈夫，失小子。随有求得，利居贞。",  
            "九四": "九四：随有获，贞凶。有孚在道，以明，何咎。",  
            "九五": "九五：孚于嘉，吉。",  
            "上六": "上六：拘系之，乃从维之，王用亨于西山。"  
        },  
        "interpretation": {  
            "fortune": "随卦象征随和顺从，灵活应变。时运方面显示您当前需要顺应时势，灵活调整策略。建议保持开放心态，善于听取他人意见。未来半年内，环境多变，需要随机应变。总体运势为中上，关键在于知进退，识时务，顺势而为，才能获得成功和发展机会。",  
            "wealth": "财运平稳，利于灵活投资。随卦主顺应变化，预示财务状况需要灵活调整。建议关注市场变化，及时调整投资策略。近期可能有变动性收入，需注意资金流动。未来一年内，财运指数70分，宜灵活应对市场变化，顺势而为，抓住投资机会。",  
            "career": "工作需要灵活应变，适应变化。随卦象征顺应，预示职场环境多变，需要快速适应新情况。建议保持学习能力，灵活处理工作任务。领导欣赏您的适应能力。未来一年内，职业运势良好，可能需要适应新岗位或新项目，灵活应对是关键。",  
            "marriage": "感情关系和谐，需互相迁就。随卦主顺从体谅，预示夫妻关系中需要互相理解和迁就。单身者宜展现随和的一面，更易获得好感。已婚者家庭生活融洽，宜互相体谅。建议避免固执己见，多做让步。未来两年内，婚姻运势良好，和谐幸福。",  
            "health": "身体状况良好，适应力强。随卦象征灵活应变，预示您具备良好的身体适应能力。建议保持灵活的生活方式，适当调整作息。注意饮食多样化，避免单一饮食。保持良好心态，适应环境变化。未来一年内，健康运势稳定，宜保持灵活的生活态度。",  
            "lifespan": "寿命较长，适应能力好。随卦主顺应变化，预示您具备良好的适应能力和抗压能力，有助于健康长寿。建议保持灵活的生活态度，适应环境变化。60岁以后可学习新事物，保持大脑活跃。总体寿命预测在78-85岁，晚年生活适应力强。"  
        }  
    },  
    "18": {  
        "name": "蛊",  
        "hexagram": "☶☷",  
        "chinese_name": "蛊",  
        "english_name": "Work on What Has Been Spoiled",  
        "image": "蛊：元，亨，利涉大川。先甲三日，后甲三日。",  
        "judgment": "蛊：元，亨，利涉大川。先甲三日，后甲三日。",  
        "image_comment": "山下有风，蛊；君子以振民育德。",  
        "lines": {  
            "初六": "初六：干父之蛊，有子，考无咎，厉终吉。",  
            "九二": "九二：干母之蛊，不可贞。",  
            "九三": "九三：干父小有晦，终吉。",  
            "六四": "六四：裕父之蛊，往见吝。",  
            "六五": "六五：干父之蛊，用誉。",  
            "上九": "上九：不事王侯，高尚其事。"  
        },  
        "interpretation": {  
            "fortune": "蛊卦象征腐朽整治，革新变革。时运方面显示您当前需要清理旧有问题，改革创新。建议勇于面对问题，大胆进行变革。未来半年内，整治工作繁重但有成效。总体运势为中吉，关键在于果断决策，彻底清理积弊，才能迎来新生和新的发展机会。",  
            "wealth": "财运一般，需要财务改革。蛊卦主整治腐朽，预示财务管理存在问题，需要进行彻底改革。建议清理不良投资，优化财务结构。近期可能有清理损失的支出，但长远有益。未来一年内，财运指数60分，宜进行财务体检，改革理财方式，为未来发展做准备。",  
            "career": "工作需要改革创新，清理积弊。蛊卦象征革新，预示职场中存在管理问题或工作流程不畅。建议大胆提出改革建议，优化工作方法。领导可能支持您的改革想法。未来一年内，职业运势向好，通过改革可能获得认可和晋升机会。",  
            "marriage": "感情关系需要重新调整。蛊卦主整治，预示婚姻中可能存在沟通问题或习惯问题。建议夫妻双方坦诚沟通，共同解决问题。单身者宜反思择偶标准，避免重蹈覆辙。已婚者需共同努力，改善家庭关系。未来两年内，婚姻运势改善，需要双方共同努力。",  
            "health": "身体状况需要调理整治。蛊卦象征清理，预示可能存在慢性疾病或不良生活习惯。建议进行全面体检，调整生活方式。注意饮食卫生，改善不良习惯。多进行排毒养生，如喝茶、按摩等。未来一年内，健康运势好转，宜积极调理身体。",  
            "lifespan": "寿命中等偏上，通过调理可延长。蛊卦主整治革新，预示通过健康管理可以改善体质。建议从现在开始调整生活习惯，清除不良嗜好。60岁以前需特别关注肝脏和消化系统健康。总体寿命预测在75-82岁，通过积极调理可延长寿命。"  
        }  
    },  
    "19": {  
        "name": "临",  
        "hexagram": "☷☱",  
        "chinese_name": "临",  
        "english_name": "Approach",  
        "image": "临：元，亨，利贞。至于八月有凶。",  
        "judgment": "临：元，亨，利贞。至于八月有凶。",  
        "image_comment": "泽上有地，临；君子以教思无穷，容保民无疆。",  
        "lines": {  
            "初九": "初九：咸临，贞吉。",  
            "九二": "九二：咸临，吉，无不利。",  
            "六三": "六三：甘临，无攸利，既忧之，无咎。",  
            "六四": "六四：至临，无咎。",  
            "六五": "六五：知临，大君之宜，吉。",  
            "上六": "上六：敦临，吉，无咎。"  
        },  
        "interpretation": {  
            "fortune": "临卦象征亲临视察，关怀备至。时运方面显示您当前处于备受关注和支持的阶段，领导重视，贵人相助。建议积极表现，赢得更多信任。未来半年内，发展机会增多，声望提升。总体运势为大吉，关键在于真诚待人，善用时机，稳步提升个人地位和影响力。",  
            "wealth": "财运亨通，收入稳定增长。临卦主亲临关注，预示财务状况受到重视，可能获得加薪或奖金。建议积极参与重要项目，争取更多资源支持。近期财运良好，宜合理规划收入。未来一年内，财运指数82分，稳步提升，宜抓住发展机遇。",  
            "career": "事业发展顺利，领导赏识。临卦象征亲临视察，预示您的工作将得到上级关注和支持。建议积极汇报工作进展，展现个人能力。团队合作顺利，同事支持。未来一年内，职业运势极佳，可能获得晋升或重要项目负责人的职位。",  
            "marriage": "家庭关系和谐，备受尊重。临卦主亲临关怀，预示家庭中您的地位稳固，备受家人尊重。单身者有望获得长辈支持，顺利发展感情。已婚者家庭生活美满，夫妻和睦。建议多关心家庭成员，增进家庭感情。未来两年内，婚姻运势良好，家庭幸福。",  
            "health": "身体状况良好，受到良好照顾。临卦象征关怀，预示健康状况稳定，医疗条件良好。建议保持现有健康习惯，继续规律体检。心理状态乐观，家庭支持强。注意预防季节性疾病，保持良好作息。未来一年内，健康运势稳定，宜继续健康生活方式。",  
            "lifespan": "寿命较长，晚年生活尊贵。临卦主亲临关怀，预示您将获得良好的医疗和生活照顾，有助于健康长寿。建议保持与家人的良好关系，获得家庭支持。60岁以后医疗条件优越，可享受高品质健康服务。总体寿命预测在80-87岁，晚年生活体面。"  
        }  
    },  
    "20": {  
        "name": "观",  
        "hexagram": "☴☷",  
        "chinese_name": "观",  
        "english_name": "Contemplation",  
        "image": "观：盥而不荐，有孚颙若。",  
        "judgment": "观：盥而不荐，有孚颙若。",  
        "image_comment": "风行地上，观；先王以省方观民，设教而行法。",  
        "lines": {  
            "初六": "初六：童观，小人无咎，君子之蛊。",  
            "六二": "六二：窥观，利女贞。",  
            "六三": "六三：观我生，进退。",  
            "六四": "六四：观国之光，利用宾于王。",  
            "九五": "九五：观我生，君子无咎。",  
            "上九": "上九：观其生，君子无咎。"  
        },  
        "interpretation": {  
            "fortune": "观卦象征观察审视，反思规划。时运方面显示您当前需要停下来观察形势，审视自我。建议多思考人生方向，制定长远规划。未来半年内，适合学习和自我提升，为未来发展做准备。总体运势为中吉，关键在于深入思考，找到正确方向，避免盲目行动。",  
            "wealth": "财运平稳，适合规划理财。观卦主观察思考，预示当前不宜大动作投资，适合观察市场制定理财计划。建议学习投资知识，提升理财能力。近期财务状况稳定，无大起大落。未来一年内，财运指数65分，宜通过学习提升未来的财务能力。",  
            "career": "工作需要反思和规划。观卦象征观察，预示您需要审视职业发展方向，考虑是否需要调整职业规划。建议与导师交流，参加职业培训。当前工作稳定，但缺乏突破。未来一年内，职业运势平稳，需要通过学习和规划为未来发展做准备。",  
            "marriage": "感情关系需要反思沟通。观卦主观察思考，预示感情中需要更多理解和沟通。单身者宜反思择偶标准，避免盲目交往。已婚者需关注夫妻关系，增进相互理解。建议多进行深入交流，了解对方的真实想法。未来两年内，婚姻运势需要用心经营。",  
            "health": "身体状况稳定，适合养生调理。观卦象征观察，预示健康状况平稳，无大病。建议利用这段时间进行养生调理，学习健康知识。注意预防慢性疾病，建立健康的生活习惯。保持良好心态，避免焦虑。未来一年内，健康运势稳定，宜注重养生。",  
            "lifespan": "寿命中等偏上，需注重养生。观卦主观察思考，预示您具备良好的自我观察能力，有助于健康管理。建议学习养生知识，建立科学的健康观念。60岁以前需建立良好的养生习惯。总体寿命预测在75-82岁，通过科学养生可延长寿命。"  
        }  
    },  
    "21": {  
        "name": "噬嗑",  
        "hexagram": "☲☳",  
        "chinese_name": "噬嗑",  
        "english_name": "Biting Through",  
        "image": "噬嗑：亨。利用狱。",  
        "judgment": "噬嗑：亨。利用狱。",  
        "image_comment": "雷电噬嗑，先王以明罚勑法。",  
        "lines": {  
            "初九": "初九：屦校灭趾，无咎。",  
            "六二": "六二：噬肤灭鼻，无咎。",  
            "六三": "六三：噬腊肉，遇毒。小吝，无咎。",  
            "九四": "九四：噬干胏，得金矢。利艰贞，吉。",  
            "六五": "六五：噬干肉，得黄金。贞厉，无咎。",  
            "上九": "上九：何校灭耳，凶。"  
        },  
        "interpretation": {  
            "fortune": "噬嗑卦象征咬合除障，坚决果断。时运方面显示您当前需要果断处理问题，清除障碍。建议勇于面对困难，大胆决策。未来半年内，问题解决后将迎来新发展。总体运势为中上，关键在于坚决果断，彻底解决问题，才能迎来新的发展机遇。",  
            "wealth": "财运好转，需要清理财务问题。噬嗑卦主清除障碍，预示需要处理财务纠纷或不良投资。建议果断止损，清理不良资产。近期可能有解决经济问题的机会。未来一年内，财运指数70分，通过清理问题后，财务状况将明显改善。",  
            "career": "工作需要果断处理问题。噬嗑卦象征坚决除障，预示职场中存在需要解决的矛盾或问题。建议大胆提出解决方案，果断处理工作中的障碍。领导欣赏您的决断力。未来一年内，职业运势向好，通过解决问题可能获得晋升或重要任务。",  
            "marriage": "感情关系需要果断处理矛盾。噬嗑卦主清除障碍，预示婚姻中存在需要解决的问题。建议夫妻双方坦诚沟通，果断处理矛盾。单身者需果断结束不合适的关系。已婚者需坚决处理家庭矛盾。未来两年内，婚姻运势改善，需要果断行动。",  
            "health": "身体状况需要果断治疗。噬嗑卦象征清除，预示可能存在需要治疗的健康问题。建议及时就医，不要拖延治疗。注意口腔和消化系统健康，保持口腔卫生。果断处理健康问题，避免小病变大病。未来一年内，健康运势好转，宜积极治疗。",  
            "lifespan": "寿命中等，通过积极治疗可改善。噬嗑卦主清除障碍，预示通过积极治疗可以解决健康问题。建议重视早期治疗，不要拖延病情。60岁以前需建立良好的健康意识。总体寿命预测在73-80岁，通过积极治疗可延长寿命。"  
        }  
    },  
    "22": {  
        "name": "贲",  
        "hexagram": "☶☲",  
        "chinese_name": "贲",  
        "english_name": "Grace",  
        "image": "贲：亨。小利有攸往。",  
        "judgment": "贲：亨。小利有攸往。",  
        "image_comment": "山下有火，贲；君子以明庶政，无敢折狱。",  
        "lines": {  
            "初九": "初九：贲其趾，舍车而徒。",  
            "六二": "六二：贲其须。",  
            "九三": "九三：贲如濡如，永贞吉。",  
            "六四": "六四：贲如皤如，白马翰如。匪寇婚媾。",  
            "六五": "六五：贲于丘园，束帛戋戋，吝，终吉。",  
            "上九": "上九：白贲，无咎。"  
        },  
        "interpretation": {  
            "fortune": "贲卦象征文饰修饰，注重形象。时运方面显示您当前需要注重个人形象和礼仪修养。建议提升个人素养，注意外在表现。未来半年内，形象好转将为您带来更多机会。总体运势为中吉，关键在于内外兼修，提升个人魅力，才能获得更好发展。",  
            "wealth": "财运平稳，利于形象投资。贲卦主文饰，预示通过提升形象可以带来间接财运。建议投资于个人形象提升，如服装、培训等。近期财务状况稳定，适合小额消费提升形象。未来一年内，财运指数68分，通过形象提升获得更多商业机会。",  
            "career": "工作需要注重形象和礼仪。贲卦象征文饰，预示职场中形象和礼仪很重要。建议注意着装和言谈举止，给人良好第一印象。领导欣赏有修养的员工。未来一年内，职业运势良好，形象提升将为您带来晋升机会。",  
            "marriage": "感情关系需要注重礼仪修养。贲卦主文饰，预示感情中需要注意礼貌和形象。单身者宜展现有修养的一面，更易吸引优质对象。已婚者需注意夫妻间的礼仪和尊重。建议提升个人魅力，增进感情吸引力。未来两年内，婚姻运势良好。",  
            "health": "身体状况良好，注重仪容。贲卦象征文饰，预示外在形象良好，内在健康稳定。建议保持良好仪容，注重个人卫生。适当进行美容养生，提升整体气质。保持良好心态，形象健康兼顾。未来一年内，健康运势稳定，宜注重形象管理。",  
            "lifespan": "寿命中等偏上，形象有助于健康。贲卦主文饰修养，预示良好的形象管理有助于心理健康。建议保持优雅的生活态度，注重个人修养。60岁以后可学习礼仪养生，保持良好心态。总体寿命预测在75-82岁，形象良好有助于晚年生活质量。"  
        }  
    },  
    "23": {  
        "name": "剥",  
        "hexagram": "☶☷",  
        "chinese_name": "剥",  
        "english_name": "Splitting Apart",  
        "image": "剥：不利有攸往。",  
        "judgment": "剥：不利有攸往。",  
        "image_comment": "山附于地，剥；上以厚下安宅。",  
        "lines": {  
            "初六": "初六：剥床以足，蔑贞凶。",  
            "六二": "六二：剥床以辨，蔑贞凶。",  
            "六三": "六三：剥之，无咎。",  
            "六四": "六四：剥床以肤，凶。",  
            "六五": "六五：贯鱼，以宫人宠，无不利。",  
            "上九": "上九：硕果不食，君子得舆，小人剥庐。"  
        },  
        "interpretation": {  
            "fortune": "剥卦象征剥落衰败，事事不顺。时运方面显示您当前处于衰退低谷期，建议韬光养晦，避免重大决策。未来半年内，环境恶劣，需要忍耐等待。总体运势为大凶，关键在于保护现有成果，保存实力，等待时机转变，不要盲目行动，以免造成更大损失。",  
            "wealth": "财运低迷，需保护现有资产。剥卦主剥落衰败，预示财务状况恶化，可能出现亏损。建议停止一切投资，保护现有资金。近期避免借贷和担保，控制开支。未来一年内，财运指数35分，宜固守现有财富，度过经济难关。",  
            "career": "工作停滞，发展受阻严重。剥卦象征衰败，预示职场中可能面临裁员、降职或项目失败。建议保持低调，保护现有职位。利用这段时间学习新技能，为未来做准备。未来一年内，职业运势极差，可能需要转换工作或行业。",  
            "marriage": "感情关系紧张，易有分离危机。剥卦主剥落，预示婚姻可能面临严重考验，甚至离婚危机。单身者感情运极差，不宜结婚。已婚者需加倍努力维护婚姻，避免矛盾激化。建议寻求专业婚姻咨询。未来两年内，婚姻运势低谷，需要谨慎处理。",  
            "health": "身体状况不佳，疾病缠身。剥卦象征衰败，预示健康状况恶化，可能出现多种疾病。建议全面体检，积极治疗现有疾病。注意饮食卫生，避免传染病。保持良好心态，避免焦虑加重病情。未来一年内，健康运势极差，需高度重视健康问题。",  
            "lifespan": "寿命受到严重影响，需要紧急调理。剥卦主严重衰败，预示当前健康状况危急。建议立即调整生活方式，寻求专业医疗帮助。60岁以前需建立坚实的健康基础。总体寿命预测在65-72岁，通过积极治疗和调理可有所改善。"  
        }  
    },  
    "24": {  
        "name": "复",  
        "hexagram": "☷☳",  
        "chinese_name": "复",  
        "english_name": "Return",  
        "image": "复：亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。",  
        "judgment": "复：亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。",  
        "image_comment": "雷在地中，复；先王以至日闭关，商旅不行，后不省方。",  
        "lines": {  
            "初九": "初九：不远复，无祇悔，元吉。",  
            "六二": "六二：休复，吉。",  
            "六三": "六三：频复，厉，无咎。",  
            "六四": "六四：中行独复。",  
            "六五": "六五：敦复，无悔。",  
            "上六": "上六：迷复，凶，有灾眚。用行师，终有大败，以其国君凶；至于十年不克征。"  
        },  
        "interpretation": {  
            "fortune": "复卦象征复归正道，重新开始。时运方面显示您当前将迎来转机，从低谷走向新生。建议把握机会，重新规划人生方向。未来半年内，运势逐渐好转，重新获得发展机会。总体运势为大吉，关键在于及时调整，重新出发，摆脱过去阴影，迎接新的开始。",  
            "wealth": "财运好转，迎来经济复苏。复卦主复归，预示财务状况将逐渐改善，可能获得新的收入来源。建议清理旧账，重新制定理财计划。近期可能有小额收益，逐渐恢复。未来一年内，财运指数75分，从低谷走向复苏，宜抓住投资机会。",  
            "career": "工作迎来转机，重新获得机会。复卦象征复归，预示职场低谷结束，将获得新的发展机会。建议积极寻找新职位或项目，展现个人能力。领导重新关注您的表现。未来一年内，职业运势好转，可能获得重要工作机会或职位恢复。",  
            "marriage": "感情关系修复，迎来新的开始。复卦主复归，预示感情低谷结束，有望修复破裂关系或开始新恋情。单身者桃花运回升，容易遇到合适对象。已婚者夫妻关系改善。建议积极沟通，重新建立信任。未来两年内，婚姻运势好转，感情重生。",  
            "health": "身体状况好转，疾病逐渐痊愈。复卦象征复归，预示健康状况改善，慢性疾病有望痊愈。建议坚持治疗，继续健康生活方式。保持良好心态，积极进行康复锻炼。注意预防复发，巩固治疗效果。未来一年内，健康运势明显好转，宜继续调理。",  
            "lifespan": "寿命恢复正常，健康状况改善。复卦主复归正道，预示通过调理，健康状况将恢复正常。建议建立科学的健康管理制度，定期体检。60岁以后需继续保持良好习惯。总体寿命预测在75-82岁，通过积极调理，寿命有望延长。"  
        }  
    },  
    "25": {  
        "name": "无妄",  
        "hexagram": "☰☳",  
        "chinese_name": "无妄",  
        "english_name": "Innocence",  
        "image": "无妄：元，亨，利贞。其匪正有眚，不利有攸往。",  
        "judgment": "无妄：元，亨，利贞。其匪正有眚，不利有攸往。",  
        "image_comment": "天下雷行，物与无妄；先王以茂对时，育万物。",  
        "lines": {  
            "初九": "初九：无妄，往吉。",  
            "六二": "六二：不耕获，不菑畲，则利有攸往。",  
            "六三": "六三：无妄之灾，或系之牛，行人之得，邑人之灾。",  
            "九四": "九四：可贞，无咎。",  
            "九五": "九五：无妄之疾，勿药有喜。",  
            "上九": "上九：无妄，行有眚，无攸利。"  
        },  
        "interpretation": {  
            "fortune": "无妄卦象征无虚妄，真诚自然。时运方面显示您当前需要保持真诚态度，顺其自然。建议遵循正道，避免投机取巧。未来半年内，真诚态度将为您赢得信任和机会。总体运势为中上，关键在于真诚待人，顺应自然规律，才能获得长久的成功和发展。",  
            "wealth": "财运平稳，利于正当经营。无妄卦主真诚无欺，预示通过正当经营获得稳定收益。建议避免投机取巧，专注主业发展。近期财务状况稳定，正当收入增加。未来一年内，财运指数72分，宜诚信经营，稳步发展，避免风险投资。",  
            "career": "工作顺利，真诚赢得信任。无妄卦象征真诚，预示职场中您的真诚态度将获得领导和同事认可。建议保持专业态度，踏实工作。避免投机取巧，专注本职。未来一年内，职业运势良好，可能因真诚态度获得重要信任和机会。",  
            "marriage": "感情真诚，关系稳定发展。无妄卦主真诚无妄，预示感情关系建立在真诚基础上。单身者宜展现真实自我，更易获得真爱。已婚者夫妻感情真挚，家庭和睦。建议保持真诚沟通，避免虚假掩饰。未来两年内，婚姻运势良好，真诚为本。",  
            "health": "身体状况良好，自然调养。无妄卦象征自然，预示健康状况稳定，顺应自然规律。建议遵循自然作息，避免过度干预。保持均衡饮食，适度运动。注意心理健康，保持自然心态。未来一年内，健康运势稳定，宜顺应自然规律养生。",  
            "lifespan": "寿命较长，自然养生有效。无妄卦主顺应自然，预示通过自然养生可以获得健康长寿。建议遵循自然规律，保持简单生活方式。60岁以后可学习自然疗法，保持身心平衡。总体寿命预测在78-85岁，自然养生有助于延长寿命。"  
        }  
    },  
    "26": {  
        "name": "大畜",  
        "hexagram": "☶☰",  
        "chinese_name": "大畜",  
        "english_name": "The Taming Power of the Great",  
        "image": "大畜：利贞，不家食吉，利涉大川。",  
        "judgment": "大畜：利贞，不家食吉，利涉大川。",  
        "image_comment": "天在山中，大畜；君子以多识前言往行，以畜其德。",  
        "lines": {  
            "初九": "初九：有厉，利已。",  
            "九二": "九二：舆说輹。",  
            "九三": "九三：良马逐，利艰贞。曰闲舆卫，利有攸往。",  
            "六四": "六四：童牛之牿，元吉。",  
            "六五": "六五：豕之牙，吉。",  
            "上九": "上九：何天之衢，亨。"  
        },  
        "interpretation": {  
            "fortune": "大畜卦象征大有蓄积，厚德载物。时运方面显示您当前处于积累阶段，建议广泛学习，厚积薄发。未来半年内，知识和经验积累将为您带来重要机遇。总体运势为大吉，关键在于广泛学习，不断积累，为未来的大发展做好充分准备，厚德才能载物。",  
            "wealth": "财运稳定，利于长期投资。大畜卦主蓄积，预示财务状况稳步增长，适合长期投资规划。建议学习理财知识，制定长期财富积累计划。近期收入稳定，适合储蓄和稳健投资。未来一年内，财运指数78分，稳步积累，厚积薄发。",  
            "career": "职业发展稳定，需要持续学习。大畜卦象征蓄养，预示您需要不断学习提升专业能力。建议参加培训课程，获得专业认证。领导欣赏有深度的员工。未来一年内，职业运势良好，通过学习积累可能获得重要晋升或项目机会。",  
            "marriage": "家庭关系稳定，需共同成长。大畜卦主蓄积，预示婚姻需要双方共同学习和成长。单身者宜寻找有共同成长目标的对象。已婚者家庭生活稳定，宜共同学习新技能。建议夫妻共同进步，增进感情深度。未来两年内，婚姻运势良好，共同成长。",  
            "health": "身体状况良好，适合养生学习。大畜卦象征蓄养，预示体质稳定，适合学习养生知识。建议了解中医养生，制定健康计划。保持均衡饮食，适度运动。学习健康管理知识，提升健康素养。未来一年内，健康运势稳定，宜持续学习养生。",  
            "lifespan": "寿命较长，学习养生有益。大畜卦主厚积薄发，预示通过学习养生知识可以延长寿命。建议持续学习健康知识，掌握科学养生方法。60岁以后可系统学习养生之道，保持身体健康。总体寿命预测在80-87岁，学习养生至关重要。"  
        }  
    },  
    "27": {  
        "name": "颐",  
        "hexagram": "☶☰",  
        "chinese_name": "颐",  
        "english_name": "The Corners of the Mouth",  
        "image": "颐：贞吉。观颐，自求口实。",  
        "judgment": "颐：贞吉。观颐，自求口实。",  
        "image_comment": "山雷颐；君子以慎言语，节饮食。",  
        "lines": {  
            "初九": "初九：舍尔灵龟，观我朵颐，凶。君子无噫，行三日不食。",  
            "六二": "六二：颠颐，拂经，于丘颐，征凶。",  
            "六三": "六三：拂颐，贞凶。十年勿用，无攸利。",  
            "六四": "六四：颠颐，吉。虎视眈眈，其欲逐逐，无咎。",  
            "六五": "六五：拂经，居贞吉。不可涉大川。",  
            "上九": "上九：由颐；厉吉，利涉大川。"  
        },  
        "interpretation": {  
            "fortune": "颐卦象征养育调理，饮食养生。时运方面显示您当前需要注重自我调养和健康管理。建议关注饮食习惯，保持身心平衡。未来半年内，养生调理将为您带来更好的状态和机遇。总体运势为中吉，关键在于合理饮食，注重养生，才能保持最佳状态迎接发展机会。",  
            "wealth": "财运平稳，注意饮食开支。颐卦主饮食养生，预示需要合理控制餐饮消费。建议制定健康饮食预算，避免过度消费。近期可能有与健康饮食相关的支出，如购买营养品。未来一年内，财运指数65分，饮食养生有助于保持工作状态，间接提升收入。",  
            "career": "工作稳定，需要保持良好状态。颐卦象征调养，预示您需要保持良好的身体和工作状态。建议注意工作节奏，避免过度劳累。领导关注员工健康状况。未来一年内，职业运势平稳，保持良好状态是成功关键，可能获得稳定发展机会。",  
            "marriage": "家庭生活温馨，注重饮食健康。颐卦主饮食养生，预示家庭中需要关注饮食健康。夫妻共同关注健康饮食，增进家庭感情。单身者可通过健康饮食聚会结识对象。已婚者家庭生活和谐，共同养生。未来两年内，婚姻运势良好，健康生活促进家庭幸福。",  
            "health": "身体状况良好，注重饮食调养。颐卦象征养生，预示健康状况稳定，但需注意饮食健康。建议学习营养学知识，制定科学饮食计划。保持规律饮食，避免暴饮暴食。多食新鲜蔬果，保持肠胃健康。未来一年内，健康运势良好，饮食调养是关键。",  
            "lifespan": "寿命较长，饮食养生关键。颐卦主饮食调养，预示通过科学饮食可以显著延长寿命。建议学习营养学，建立健康的饮食习惯。60岁以后严格控制饮食，保持肠胃健康。避免不良饮食习惯，如油腻、高糖食物。总体寿命预测在80-88岁，饮食养生至关重要。"  
        }  
    },  
    "28": {  
        "name": "大过",  
        "hexagram": "☱☴",  
        "chinese_name": "大过",  
        "english_name": "Preponderance of the Great",  
        "image": "大过：栋桡，利有攸往，亨。",  
        "judgment": "大过：栋桡，利有攸往，亨。",  
        "image_comment": "泽风大过；君子以独立不惧，遁世无闷。",  
        "lines": {  
            "初六": "初六：藉用白茅，无咎。",  
            "九二": "九二：枯杨生稊，老夫得其女妻，无不利。",  
            "九三": "九三：栋桡，凶。",  
            "九四": "九四：栋隆，吉；有它吝。",  
            "九五": "九五：枯杨生华，老妇得士夫，无咎无誉。",  
            "上六": "上六：过涉灭顶，凶，无咎。"  
        },  
        "interpretation": {  
            "fortune": "大过卦象征过度负担，需谨慎处理。时运方面显示您当前压力过大，责任重大。建议合理分配任务，避免过度承担。未来半年内，需要调整工作重心，减轻负担。总体运势为中下，关键在于量力而行，合理规划，避免因过度努力导致失败或健康问题。",  
            "wealth": "财运波动，投资需谨慎。大过卦主过度，预示财务压力大，可能承担过多经济责任。建议控制投资规模，避免过度借贷。近期可能有较大经济支出，需做好准备。未来一年内，财运指数55分，宜减少经济风险，合理规划财务。",  
            "career": "工作压力巨大，需合理安排。大过卦象征重负，预示您可能承担过多工作任务。建议学会拒绝，合理分配工作。领导可能对您期望过高。未来一年内，职业运势压力大，需要学会管理时间和精力，避免过度劳累影响工作质量。",  
            "marriage": "婚姻关系紧张，压力过大。大过卦主过度负担，预示家庭责任重，可能因工作忙碌忽略家庭。单身者感情发展缓慢，工作压力影响社交。已婚者需平衡工作和家庭，避免婚姻危机。建议合理安排时间，关注家庭关系。未来两年内，婚姻运势需谨慎。",  
            "health": "身体状况不佳，过度劳累。大过卦象征重负，预示健康状况因过度劳累而恶化。建议立即调整工作强度，保证充足休息。注意心血管和神经系统健康，避免过度焦虑。定期体检，及时调整生活节奏。未来一年内，健康运势较差，需高度重视身体健康。",  
            "lifespan": "寿命受工作压力影响。大过卦主过度负担，预示工作压力可能严重影响健康和寿命。建议学会工作生活平衡，控制工作强度。60岁以前需建立合理的工作习惯，避免过度劳累。总体寿命预测在70-77岁，通过减轻压力可改善寿命。"  
        }  
    },  
    "29": {  
        "name": "坎",  
        "hexagram": "☵☵",  
        "chinese_name": "坎",  
        "english_name": "The Abysmal",  
        "image": "习坎：有孚，维心亨，行有尚。",  
        "judgment": "习坎：有孚，维心亨，行有尚。",  
        "image_comment": "水洊至，习坎；君子以常德行，习教事。",  
        "lines": {  
            "初六": "习坎，入于坎窞，凶。",  
            "九二": "九二：坎有险，求小得。",  
            "六三": "六三：来之坎坎，险且枕，入于坎窞，勿用。",  
            "六四": "六四：樽酒簋贰，用缶，纳约自牖，终无咎。",  
            "九五": "九五：坎不盈，仅既平，無咎。",  
            "上六": "上六：系用徽纆，置于丛棘，三岁不觏，凶。"  
        },  
        "interpretation": {  
            "fortune": "坎卦象征重险困境，需谨慎应对。时运方面显示您当前处于重重困难之中，环境险恶。建议保持冷静，步步为营，避免冒险。未来半年内，困境持续，需要坚韧意志。总体运势为大凶，关键在于保持信心，谨慎行事，逐步化解困难，度过险境。",  
            "wealth": "财运低迷，财务困境严重。坎卦主重重险阻，预示财务状况极差，可能面临资金链断裂。建议紧急筹措资金，控制所有开支。避免任何投资和借贷，保护最后资产。未来一年内，财运指数30分，财务危机，需要家人朋友支持度过难关。",  
            "career": "工作陷入困境，发展停滞。坎卦象征险阻，预示职场中面临严重挑战，可能失业或项目失败。建议保持低调，寻找备用方案。利用困境学习新技能，为未来做准备。未来一年内，职业运势极差，需要重新规划职业方向。",  
            "marriage": "感情关系危机，面临分离。坎卦主困境，预示婚姻可能面临严重考验，甚至离婚危机。单身者感情运极差，不宜发展新关系。已婚者需共同面对困难，避免互相指责。建议寻求专业帮助，挽救婚姻。未来两年内，婚姻运势低谷，需要共同努力。",  
            "health": "身体状况危急，疾病严重。坎卦象征重病，预示健康状况极差，可能面临重大疾病。建议立即就医，积极治疗。注意心理健康，避免抑郁。家人支持和良好心态对康复至关重要。未来一年内，健康运势极差，需全力治疗康复。",  
            "lifespan": "寿命面临严重威胁，需要紧急治疗。坎卦主重险，预示健康危机可能严重影响寿命。建议立即调整生活方式，积极治疗现有疾病。建立坚实的医疗保障体系。总体寿命预测在60-68岁，通过积极治疗和良好心态可有所改善。"  
        }  
    },  
    "30": {  
        "name": "离",  
        "hexagram": "☲☲",  
        "chinese_name": "离",  
        "english_name": "The Clinging",  
        "image": "离：利贞，亨。畜牝牛，吉。",  
        "judgment": "离：利贞，亨。畜牝牛，吉。",  
        "image_comment": "明两作，离；大人以继明照于四方。",  
        "lines": {  
            "初九": "初九：履错然，敬之无咎。",  
            "六二": "六二：黄离，元吉。",  
            "九三": "九三：日昃之离，不鼓缶而歌，则大耋之嗟，凶。",  
            "九四": "九四：突如其来如，焚如，死如，弃如。",  
            "六五": "六五：出涕沱若，戚嗟若，吉。",  
            "上九": "上九：王用出征，有嘉折首，获匪其丑，吉。"  
        },  
        "interpretation": {  
            "fortune": "离卦象征光明依附，文明教化。时运方面显示您当前处于光明向上的阶段，智慧和文明将为您带来成功。建议发挥智慧，积极传播正能量。未来半年内，声望提升，获得广泛认可。总体运势为大吉，关键在于保持光明正大的态度，文明处世，才能持续获得成功。",  
            "wealth": "财运亨通，智慧理财成功。离卦主光明智慧，预示通过智慧决策获得丰厚财运。建议学习投资知识，制定科学理财计划。近期可能有智慧型投资获得回报。未来一年内，财运指数85分，智慧理财将带来可观收益。",  
            "career": "事业光明，智慧获得认可。离卦象征文明智慧，预示职场中您的智慧和专业能力将获得广泛认可。建议积极展现才华，参与重要项目。领导器重有智慧的员工。未来一年内，职业运势极佳，可能获得高层职位或重要项目主导权。",  
            "marriage": "感情光明，关系和谐美满。离卦主光明正大，预示感情关系建立在真诚和信任基础上。单身者有望遇到智慧优雅的对象。已婚者夫妻感情深厚，家庭文明和谐。建议保持真诚沟通，增进感情深度。未来两年内，婚姻运势极佳，幸福美满。",  
            "health": "身体状况良好，精神明朗。离卦象征光明，预示心理状态极佳，身体健康。建议保持积极心态，继续健康生活方式。注意眼睛健康，避免长时间用眼。适当进行户外活动，吸收阳光。未来一年内，健康运势极好，精神状态明朗。",  
            "lifespan": "寿命长久，智慧养生有效。离卦主光明智慧，预示通过科学养生可以获得健康长寿。建议学习健康知识，保持良好心态。60岁以后可学习文明养生之道，保持身心健康。总体寿命预测在82-89岁，智慧养生有助于延长寿命。"  
        }  
    },  
    "31": {  
        "name": "咸",  
        "hexagram": "☱☶",  
        "chinese_name": "咸",  
        "english_name": "Influence",  
        "image": "咸：亨，利贞，取女吉。",  
        "judgment": "咸：亨，利贞，取女吉。",  
        "image_comment": "泽山咸，君子以虚受地。",  
        "lines": {  
            "初六": "初六：咸其拇。",  
            "六二": "六二：咸其腓，凶，居贞吉。",  
            "九三": "九三：咸其股，执其随，往吝。",  
            "九四": "九四：贞吉，悔亡，憧憧往来，朋从尔思。",  
            "九五": "九五：咸其脢，无悔。",  
            "上六": "上六：咸其辅，颊，舌。"  
        },  
        "interpretation": {  
            "fortune": "咸卦象征感应交合，和谐共处。时运方面显示您当前人际关系和谐，容易获得他人支持和合作。建议发挥感应的力量，建立良好关系。未来半年内，人缘极佳，合作机会多。总体运势为大吉，关键在于真诚交往，发挥感应力，建立深厚的人际关系网络。",  
            "wealth": "财运良好，利于合作经营。咸卦主感应和谐，预示通过良好人际关系获得商业合作机会。建议积极拓展人脉，寻找商业伙伴。近期可能有合作项目带来收益。未来一年内，财运指数80分，人际关系将为您带来丰厚商业回报。",  
            "career": "工作顺利，人际关系良好。咸卦象征和谐，预示职场中同事关系融洽，团队合作顺利。建议发挥沟通协调能力，增进团队凝聚力。领导欣赏有亲和力的员工。未来一年内，职业运势极佳，可能通过良好人际关系获得晋升和发展机会。",  
            "marriage": "感情甜蜜，夫妻和谐美满。咸卦主感应交合，预示夫妻感情深厚，相互理解。单身者桃花运旺，容易遇到心有灵犀的对象。已婚者家庭生活幸福，感情稳定。建议多创造浪漫机会，增进感情深度。未来两年内，婚姻运势极佳，幸福指数92分。",  
            "health": "身体状况良好，人际和谐有益。咸卦象征和谐，预示良好的人际关系对心理健康有积极影响。建议多参与社交活动，保持良好心态。注意沟通健康，避免因误会导致的心理压力。适当进行团体运动。未来一年内，健康运势良好，社交活跃。",  
            "lifespan": "寿命较长，人际和谐有益。咸卦主感应和谐，预示良好的人际关系和家庭支持有助于健康长寿。建议保持广泛的社交网络，获得情感支持。60岁以后可担任家庭协调角色，保持生活和谐。总体寿命预测在80-87岁，人际关系对长寿至关重要。"  
        }  
    },  
    "32": {  
        "name": "恒",  
        "hexagram": "☳☴",  
        "chinese_name": "恒",  
        "english_name": "Duration",  
        "image": "恒：耐，亨，无咎，利贞，利有攸往。",  
        "judgment": "恒：耐，亨，无咎，利贞，利有攸往。",  
        "image_comment": "雷风恒；君子以立不易方。",  
        "lines": {  
            "初六": "初六：浚恒，贞凶，无攸利。",  
            "九二": "九二：悔亡。",  
            "九三": "九三：不恒其德，或承之羞，贞吝。",  
            "九四": "九四：恒其德也，田无禽。",  
            "六五": "六五：恒其德，贞，妇人吉，夫子凶。",  
            "上六": "上六：振恒，凶。"  
        },  
        "interpretation": {  
            "fortune": "恒卦象征持久恒久，持之以恒。时运方面显示您当前需要保持持久努力，坚持正确方向。建议制定长期规划，持之以恒执行。未来半年内，坚持将带来丰厚回报。总体运势为大吉，关键在于坚持不懈，保持恒心，才能获得长久的成功和稳定发展。",  
            "wealth": "财运稳定，利于长期投资。恒卦主持久，预示通过长期坚持的理财规划获得稳定收益。建议制定长期投资计划，坚持执行。近期收入稳定，适合储蓄和长期投资。未来一年内，财运指数78分，坚持长期理财策略将获得可观回报。",  
            "career": "职业发展稳定，需要长期努力。恒卦象征持之以恒，预示职业成功需要长期积累和坚持。建议专注专业发展，不断提升技能。领导欣赏有恒心的员工。未来一年内，职业运势良好，坚持努力将获得稳步晋升和发展机会。",  
            "marriage": "婚姻稳定，需长期经营。恒卦主持久，预示婚姻需要长期的经营和培养。单身者宜寻找志同道合、能够长期相伴的对象。已婚者家庭生活稳定，感情深厚。建议保持长期的关心和沟通，增进感情。未来两年内，婚姻运势良好，稳定幸福。",  
            "health": "身体状况稳定，坚持锻炼有效。恒卦象征持久，预示通过长期坚持的健康习惯获得良好体质。建议建立长期的运动和饮食习惯，坚持执行。保持规律作息，避免间断。学习科学的养生方法。未来一年内，健康运势良好，坚持是关键。",  
            "lifespan": "寿命较长，坚持养生有效。恒卦主持之以恒，预示通过长期坚持的养生习惯可以显著延长寿命。建议建立科学的长期养生计划，坚持执行。60岁以后继续保持良好习惯，定期体检。总体寿命预测在80-88岁，坚持养生至关重要。"  
        }  
    },  
    "33": {  
        "name": "遁",  
        "hexagram": "☰☶",  
        "chinese_name": "遁",  
        "english_name": "Retreat",  
        "image": "遁：亨，小利贞。",  
        "judgment": "遁：亨，小利贞。",  
        "image_comment": "天下有山，遁；君子以远小人，不恶而严。",  
        "lines": {  
            "初六": "初六：遁尾，厉，勿用有攸往。",  
            "六二": "六二：执之用黄牛之革，莫之胜说。",  
            "九三": "九三：系遁，有疾厉，畜臣妾，吉。",  
            "九四": "九四：好遁，君子吉，小人否。",  
            "九五": "九五：嘉遁，贞吉。",  
            "上九": "上九：肥遁，无不利。"  
        },  
        "interpretation": {  
            "fortune": "遁卦象征战略撤退，暂避锋芒。时运方面显示您当前需要战略性退让，保存实力。建议审时度势，适时撤退，避免硬拼。未来半年内，环境不利，需要韬光养晦。总体运势为中下，关键在于明智撤退，保存实力，等待更好的时机再图发展。",  
            "wealth": "财运低迷，需减少投资。遁卦主撤退，预示当前不宜扩大投资，建议减少风险敞口。保护现有资产，避免损失扩大。近期可能有小额亏损，需及时止损。未来一年内，财运指数50分，宜收缩战线，等待市场好转。",  
            "career": "工作需要战略调整。遁卦象征退让，预示职场中可能需要暂时退让或转换岗位。建议审时度势，避免与上级硬碰硬。利用这段时间学习新技能，为未来做准备。未来一年内，职业运势低迷，需要战略性调整，寻找新的发展机会。",  
            "marriage": "感情关系紧张，需要退让。遁卦主撤退，预示感情中可能需要一方退让，避免冲突激化。单身者宜暂时减少社交，调整心态。已婚者需避免争执，适当退让。建议冷静处理感情问题，给彼此空间。未来两年内，婚姻运势需谨慎，需要智慧处理。",  
            "health": "身体状况一般，需要休息调养。遁卦象征退避，预示当前需要减少活动量，适当休息。建议调整工作强度，避免过度劳累。注意心理健康，缓解压力。多进行放松活动，如冥想、散步等。未来一年内，健康运势一般，宜适当休息。",  
            "lifespan": "寿命中等，需要注意劳逸结合。遁卦主战略撤退，预示需要合理安排工作和休息，避免过度劳累影响健康。建议建立合理的工作生活平衡。60岁以前需学会适时休息，避免过度消耗。总体寿命预测在72-79岁，劳逸结合对健康至关重要。"  
        }  
    },  
    "34": {  
        "name": "大壮",  
        "hexagram": "☳☰",  
        "chinese_name": "大壮",  
        "english_name": "The Power of the Great",  
        "image": "大壮：利贞。",  
        "judgment": "大壮：利贞。",  
        "image_comment": "雷在天上，大壮；君子以非礼弗履。",  
        "lines": {  
            "初九": "初九：壮于趾，征凶，有孚。",  
            "九二": "九二：贞吉。",  
            "九三": "九三：小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。",  
            "九四": "九四：贞吉，悔亡。藩决不羸，壮于大舆之輹。",  
            "六五": "六五：丧羊于易，无悔。",  
            "上六": "上六：羝羊触藩，不能退，不能遂，无攸利，艰则吉。"  
        },  
        "interpretation": {  
            "fortune": "大壮卦象征大有所成，刚健有力。时运方面显示您当前处于力量充沛、事业有成的阶段。建议积极进取，大胆发展事业。未来半年内，发展势头强劲，宜乘胜追击。总体运势为大吉，关键在于刚健有为，但需注意适度，避免因过度扩张导致失败。",  
            "wealth": "财运旺盛，投资回报丰厚。大壮卦主刚健有力，预示财务状况强劲增长，可能获得大额投资回报。建议适度扩大投资规模，关注高增长行业。近期财运极佳，宜大胆决策。未来一年内，财运指数88分，财富快速积累，但需注意风险控制。",  
            "career": "事业发展迅猛，领导器重。大壮卦象征强大，预示职场中您将展现强大能力，获得重要职位。建议积极争取领导信任，主导重要项目。团队力量强大，执行力强。未来一年内，职业运势极佳，可能获得高层管理职位或重大项目成功。",  
            "marriage": "婚姻稳定，家庭力量强大。大壮卦主刚健，预示家庭经济实力强，夫妻关系稳定。单身者有望遇到事业成功的对象。已婚者家庭生活富足，子女优秀。建议合理规划家庭财富，保持家庭和谐。未来两年内，婚姻运势良好，家庭幸福指数85分。",  
            "health": "身体状况极佳，精力充沛。大壮卦象征强大，预示体质强健，精力旺盛。建议保持高强度工作，但注意劳逸结合。适当进行力量训练，增强体质。保持良好饮食，补充足够营养。未来一年内，健康运势极好，但需避免过度消耗精力。",  
            "lifespan": "寿命较长，体质强健。大壮卦主刚健有力，预示您具备强大的生命力和体质基础。建议保持积极的运动习惯，增强体质。60岁以后继续适度锻炼，保持活力。注意心血管健康，避免过度劳累。总体寿命预测在82-89岁，体质强健有助于长寿。"  
        }  
    },  
    "35": {  
        "name": "晋",  
        "hexagram": "☲☷",  
        "chinese_name": "晋",  
        "english_name": "Progress",  
        "image": "晋：康侯用锡马蕃庶，昼日三接。",  
        "judgment": "晋：康侯用锡马蕃庶，昼日三接。",  
        "image_comment": "明出地上，晋；君子以自昭明德。",  
        "lines": {  
            "初六": "初六：晋如摧如，贞吉。罔孚，裕无咎。",  
            "六二": "六二：晋如愁如，贞吉。受兹介福，于其王母。",  
            "六三": "六三：众允之，君命以为下国。",  
            "九四": "九四：晋如鼫鼠，贞厉。",  
            "六五": "六五：悔亡，失得勿恤，往吉，无不利。",  
            "上九": "上九：晋其角，维用伐邑，厉吉，无咎，贞吝。"  
        },  
        "interpretation": {  
            "fortune": "晋卦象征晋升进步，光明显达。时运方面显示您当前处于快速上升的阶段，事业和地位将显著提升。建议抓住机遇，积极展现才能。未来半年内，发展势头强劲，贵人相助。总体运势为大吉大利，宜积极进取，乘势而上，稳步晋升。",  
            "wealth": "财运旺盛，收入大幅增长。晋卦主进步发展，预示财务状况快速改善，可能获得加薪、奖金或投资收益。建议合理规划收入，适度投资增长型项目。近期财运极佳，宜扩大收入来源。未来一年内，财运指数90分，财富快速积累。",  
            "career": "职业发展迅猛，晋升在即。晋卦象征进步，预示职场中您将获得重要晋升或职位提升。领导赏识您的才能，积极提拔。建议展现领导力，积极承担更多责任。未来一年内，职业运势极佳，可能获得管理层职位或重要项目主导权。",  
            "marriage": "感情顺利，家庭地位提升。晋卦主晋升，预示家庭经济改善，社会地位提升。单身者有望遇到条件优越的对象。已婚者家庭生活富足，夫妻关系和谐。建议共同规划家庭发展，提升家庭地位。未来两年内，婚姻运势良好，家庭幸福指数88分。",  
            "health": "身体状况良好，精力充沛。晋卦象征光明进步，预示健康状况良好，精神状态积极。建议保持良好生活习惯，继续规律运动。注意预防过度劳累导致的小病。保持乐观心态，增强抵抗力。未来一年内，健康运势极好，宜保持积极状态。",  
            "lifespan": "寿命长久，晚年生活尊贵。晋卦主进步发展，预示您将获得良好的社会地位和经济基础，有助于健康长寿。建议保持积极进取的生活态度，继续发展事业。60岁以后经济宽裕，可享受高品质医疗服务。总体寿命预测在83-90岁，晚年生活体面富足。"  
        }  
    },  
    "36": {  
        "name": "明夷",  
        "hexagram": "☲☶",  
        "chinese_name": "明夷",  
        "english_name": "Darkening of the Light",  
        "image": "明夷：利艰贞。",  
        "judgment": "明夷：利艰贞。",  
        "image_comment": "明入地中，明夷；内文明而外柔顺，以蒙大难，文王以之。",  
        "lines": {  
            "初九": "初九：明夷于飞，垂其翼。君子于行，三日不食。有攸往，主人有言。",  
            "六二": "六二：明夷，夷于左股，用拯马壮，吉。",  
            "九三": "九三：明夷于南狩，得其大首，不可疾贞。",  
            "六四": "六四：入于左腹，获明夷之心，于出门庭。",  
            "六五": "六五：箕子之明夷，利贞。",  
            "上六": "上六：不明晦，初登于天，后入于地。"  
        },  
        "interpretation": {  
            "fortune": "明夷卦象征光明受伤，暂避锋芒。时运方面显示您当前处于环境恶劣的阶段，需要韬光养晦。建议保持低调，保护自己，避免锋芒毕露。未来半年内，环境不利，需要忍耐等待。总体运势为中下，关键在于明哲保身，保存实力，等待环境好转再图发展。",  
            "wealth": "财运低迷，需保护现有资产。明夷卦主光明受损，预示财务环境恶劣，可能面临经济压力。建议停止投资，保护现有资金。避免借贷和担保，控制开支。未来一年内，财运指数45分，宜低调理财，度过经济难关。",  
            "career": "工作环境恶劣，需要低调处事。明夷卦象征受抑，预示职场中可能面临小人作祟或不公待遇。建议保持低调，避免树敌。利用这段时间学习新技能，积蓄力量。未来一年内，职业运势低迷，需要忍耐和等待，可能需要转换环境。",  
            "marriage": "感情关系受外界影响。明夷卦主受抑，预示感情可能受到家庭或社会环境的干扰。单身者感情发展受阻，不宜急进。已婚者需低调处理家庭矛盾，避免外界干扰。建议保持夫妻间的信任和支持。未来两年内，婚姻运势需谨慎，需要低调处理。",  
            "health": "身体状况一般，需注意保护。明夷卦象征受伤，预示可能存在潜在健康问题。建议定期体检，注意预防疾病。保持良好心态，避免因环境压力导致心理问题。适当进行调理养生，增强抵抗力。未来一年内，健康运势一般，宜注意保护。",  
            "lifespan": "寿命中等，需要注意环境影响。明夷卦主受抑，预示环境因素可能影响健康。建议选择良好的生活环境，避免有害环境。60岁以前需建立良好的健康防护。总体寿命预测在70-77岁，通过改善生活环境可延长寿命。"  
        }  
    },  
    "37": {  
        "name": "家人",  
        "hexagram": "☴☲",  
        "chinese_name": "家人",  
        "english_name": "The Family",  
        "image": "家人：利女贞。",  
        "judgment": "家人：利女贞。",  
        "image_comment": "风自火出，家人；君子以言有物，而行有恒。",  
        "lines": {  
            "初九": "初九：闲有家，悔亡。",  
            "六二": "六二：无攸遂，在中馈，贞吉。",  
            "九三": "九三：家人嗃嗃，悔厉，吉；妇子嘻嘻，终吝。",  
            "六四": "六四：富家，大吉。",  
            "九五": "九五：王假有家，勿恤，吉。",  
            "上九": "上九：有孚威如，终吉。"  
        },  
        "interpretation": {  
            "fortune": "家人卦象征家庭和睦，内修外治。时运方面显示您当前需要注重家庭建设，建立良好的家庭氛围。建议加强家庭成员间的沟通和理解。未来半年内，家庭和谐将为您提供强有力的支持。总体运势为大吉，关键在于家庭和睦，内圣外王，才能获得全面发展。",  
            "wealth": "财运稳定，家庭理财有序。家人卦主家庭管理，预示通过良好的家庭理财获得稳定收益。建议夫妻共同制定家庭预算，合理规划开支。近期家庭经济稳定，适合家庭共同投资。未来一年内，财运指数75分，家庭和谐促进经济稳定。",  
            "career": "工作稳定，家庭支持有力。家人卦象征家庭，预示家庭的支持对职业发展有积极作用。建议保持工作家庭平衡，获得家人理解和支持。领导欣赏有家庭责任感的员工。未来一年内，职业运势良好，家庭后盾增强工作信心。",  
            "marriage": "婚姻美满，家庭和睦幸福。家人卦主家庭和谐，预示夫妻关系融洽，家庭生活温馨。单身者有望建立美满家庭。已婚者家庭生活幸福，子女孝顺。建议加强家庭沟通，建立家庭规则。未来两年内，婚姻运势极佳，家庭幸福指数90分。",  
            "health": "身体状况良好，家庭关怀有益。家人卦象征家庭，预示家庭成员间的相互关怀对健康有积极影响。建议建立家庭健康管理制度，共同关注健康。保持良好家庭氛围，缓解心理压力。未来一年内，健康运势良好，家庭支持是关键。",  
            "lifespan": "寿命较长，家庭和谐有益。家人卦主家庭和睦，预示良好的家庭关系和支持有助于健康长寿。建议建立和谐的家庭氛围，获得家庭情感支持。60岁以后家庭成员的陪伴对健康至关重要。总体寿命预测在80-87岁，家庭和谐是长寿关键。"  
        }  
    },  
    "38": {  
        "name": "睽",  
        "hexagram": "☲☱",  
        "chinese_name": "睽",  
        "english_name": "Opposition",  
        "image": "睽：小事吉。",  
        "judgment": "睽：小事吉。",  
        "image_comment": "上火下泽，睽；君子以同而异。",  
        "lines": {  
            "初九": "初九：悔亡，丧马勿逐，自复。见恶人，无咎。",  
            "九二": "九二：遇主于巷，无咎。",  
            "六三": "六三：见舆曳，其牛掣，其人天且劓，无初有终。",  
            "九四": "九四：睽孤，遇元夫，交孚，厉无咎。",  
            "六五": "六五：悔亡，厥宗噬肤，往何咎。",  
            "上九": "上九：睽孤，见豕负涂，载鬼一车，先张之弧，后说之弧。匪寇婚媾，往遇雨则吉。"  
        },  
        "interpretation": {  
            "fortune": "睽卦象征乖离对立，见解不同。时运方面显示您当前人际关系紧张，观点冲突。建议保持沟通，寻求共识。未来半年内，矛盾可能持续，需要灵活处理。总体运势为中下，关键在于求同存异，妥善处理分歧，避免冲突激化，才能逐步改善关系。",  
            "wealth": "财运一般，合作易有分歧。睽卦主对立，预示商业合作中可能出现意见分歧。建议谨慎选择合作伙伴，明确利益分配。近期避免合伙投资，专注个人项目。未来一年内，财运指数58分，宜独立经营，避免因分歧造成经济损失。",  
            "career": "工作中有矛盾冲突，需要协调。睽卦象征对立，预示团队内部可能存在分歧和矛盾。建议发挥协调能力，寻求各方共识。领导需要调解团队矛盾。未来一年内，职业运势波动，需要处理人际关系问题，改善团队氛围。",  
            "marriage": "感情关系紧张，沟通不畅。睽卦主对立，预示夫妻间可能出现严重分歧和争执。单身者感情发展受阻，容易误会。已婚者需避免争吵，保持冷静沟通。建议寻求第三方调解，改善夫妻关系。未来两年内，婚姻运势低谷，需要努力修复。",  
            "health": "身体状况一般，心理压力大。睽卦象征冲突，预示人际关系紧张可能导致心理压力。建议学习情绪管理，缓解心理压力。注意神经系统健康，避免焦虑失眠。多进行放松活动，如冥想、瑜伽等。未来一年内，健康运势一般，心理健康需关注。",  
            "lifespan": "寿命中等，人际冲突需注意。睽卦主对立冲突，预示人际关系紧张可能影响心理健康和寿命。建议学会处理人际矛盾，保持良好心态。60岁以前需建立良好的人际关系。总体寿命预测在70-77岁，通过改善人际关系可延长寿命。"  
        }  
    },  
    "39": {  
        "name": "蹇",  
        "hexagram": "☵☶",  
        "chinese_name": "蹇",  
        "english_name": "Obstruction",  
        "image": "蹇：利西南，不利东北；利见大人，贞吉。",  
        "judgment": "蹇：利西南，不利东北；利见大人，贞吉。",  
        "image_comment": "山上有水，蹇；君子以反身修古。",  
        "lines": {  
            "初六": "初六：往蹇，来誉。",  
            "六二": "六二：王臣蹇蹇，匪躬之故。",  
            "九三": "九三：往蹇来反。",  
            "六四": "六四：往蹇来连。",  
            "九五": "九五：大蹇，朋来。",  
            "上六": "上六：往蹇来硕，吉，利见大人。"  
        },  
        "interpretation": {  
            "fortune": "蹇卦象征跛蹇艰难，行动受阻。时运方面显示您当前处于发展受阻的困境期，建议耐心等待，寻求帮助。未来半年内，困难持续，需要坚韧意志。总体运势为中下，关键在于寻求贵人帮助，调整策略，耐心等待时机，才能逐步摆脱困境。",  
            "wealth": "财运低迷，发展受阻。蹇卦主行动困难，预示财务发展受阻，可能资金周转不灵。建议寻求财务援助，调整投资策略。近期避免大额支出，控制开支。未来一年内，财运指数45分，财务困境，需要外部支持和调整才能改善。",  
            "career": "工作进展缓慢，面临瓶颈。蹇卦象征受阻，预示职业发展遇到严重障碍。建议寻求上级或导师指导，调整工作策略。避免单打独斗，需要团队支持。未来一年内，职业运势低迷，可能需要转换方向或寻求外部机会。",  
            "marriage": "感情关系停滞，需要耐心。蹇卦主困难，预示感情发展受阻，可能出现沟通障碍。单身者不宜强求，等待时机。已婚者家庭生活平淡，缺乏激情。建议保持沟通，给彼此空间。未来两年内，婚姻运势缓慢，需要耐心经营。",  
            "health": "身体状况不佳，行动不便。蹇卦象征跛行，预示可能存在腿脚或关节问题。建议及时就医，注意保暖防寒。避免剧烈运动，适当进行康复训练。保持良好心态，避免焦虑加重病情。未来一年内，健康运势一般，需积极治疗。",  
            "lifespan": "寿命中等，健康问题需注意。蹇卦主行动困难，预示可能存在慢性健康问题影响寿命。建议重视早期治疗，建立康复计划。60岁以前需特别关注骨骼关节健康。总体寿命预测在68-75岁，通过积极治疗可改善健康状况。"  
        }  
    },  
    "40": {  
        "name": "解",  
        "hexagram": "☳☵",  
        "chinese_name": "解",  
        "english_name": "Deliverance",  
        "image": "解：利西南，无所往，其来复吉。有攸往，夙吉。",  
        "judgment": "解：利西南，无所往，其来复吉。有攸往，夙吉。",  
        "image_comment": "雷雨作解；君子以赦过宥罪。",  
        "lines": {  
            "初六": "初六：无咎。",  
            "九二": "九二：田获三狐，得黄矢，贞吉。",  
            "六三": "六三：负且乘，致寇至，贞吝。",  
            "九四": "九四：解而拇，朋至斯孚。",  
            "六五": "六五：君子维有解，吉，有孚于小人。",  
            "上六": "上六：公用射隼于高墉之上，获之，无不利。"  
        },  
        "interpretation": {  
            "fortune": "解卦象征解除困境，化险为夷。时运方面显示您当前将摆脱困境，迎来转机。建议积极解决问题，寻求解脱之道。未来半年内，困难逐渐解除，发展顺利。总体运势为大吉，关键在于及时解除束缚，抓住转机，积极进取，迎来新的发展机遇。",  
            "wealth": "财运好转，摆脱经济困境。解卦主解除，预示财务问题将得到解决，可能获得资金援助或债务解除。建议积极处理财务纠纷，清理不良债务。近期经济压力减轻，获得喘息机会。未来一年内，财运指数75分，从困境走向复苏。",  
            "career": "工作困境解除，迎来新机会。解卦象征解脱，预示职场中的障碍将清除，获得新的发展机会。建议积极寻找新职位或项目，展现能力。领导支持度提高。未来一年内，职业运势好转，可能获得重要工作机会或职位提升。",  
            "marriage": "感情关系改善，矛盾解除。解卦主解脱，预示感情中的矛盾和误会将消除。单身者有望摆脱感情困扰，开始新恋情。已婚者夫妻关系改善，家庭和睦。建议积极沟通，解除误会。未来两年内，婚姻运势好转，感情重生。",  
            "health": "身体状况好转，疾病缓解。解卦象征解除，预示健康问题将得到改善，疾病逐渐康复。建议坚持治疗，积极配合医生建议。保持良好心态，增强康复信心。注意预防复发，巩固治疗效果。未来一年内，健康运势明显好转，积极康复。",  
            "lifespan": "寿命恢复正常，健康改善。解卦主解除困境，预示通过积极治疗，健康状况将恢复正常。建议建立科学的健康管理制度，定期复查。保持积极心态，增强康复信心。总体寿命预测在75-82岁，通过积极治疗，寿命有望恢复正常水平。"  
        }  
    },  
    "41": {  
        "name": "损",  
        "hexagram": "☶☱",  
        "chinese_name": "损",  
        "english_name": "Decrease",  
        "image": "损：有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。",  
        "judgment": "损：有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。",  
        "image_comment": "山下有泽，损；君子以惩忿窒欲。",  
        "lines": {  
            "初九": "初九：已事遄往，无咎，酌损之。",  
            "九二": "九二：利贞，征凶，弗损益之。",  
            "六三": "六三：三人行，则损一人；一人行，则得其友。",  
            "六四": "六四：损其疾，使遄有喜，无咎。",  
            "六五": "六五：或跃在渊，无咎。",  
            "上九": "上九：弗损益之，无咎，贞吉。利有攸往，得臣无家。"  
        },  
        "interpretation": {  
            "fortune": "损卦象征减损有度，适度节制。时运方面显示您当前需要适当减损，避免过度消耗。建议合理规划资源，适度节制。未来半年内，通过减损将获得长远利益。总体运势为中吉，关键在于有度减损，合理取舍，才能避免过度消耗，获得长远发展。",  
            "wealth": "财运需要节制开支。损卦主减损，预示需要控制消费，减少不必要支出。建议制定严格预算，优先保障基本需求。近期避免奢侈消费，专注储蓄。未来一年内，财运指数60分，通过节制消费可积累更多财富，为未来投资做准备。",  
            "career": "工作需要精简，提高效率。损卦象征减损，预示需要优化工作流程，减少无效劳动。建议精简工作内容，提高工作效率。领导欣赏高效员工。未来一年内，职业运势平稳，通过工作优化可能获得认可和晋升机会。",  
            "marriage": "家庭需要合理开支，避免浪费。损卦主节制，预示家庭经济需要合理规划，避免过度消费。夫妻双方需共同节俭，合理分配家庭资源。单身者宜选择经济观念相近的对象。已婚者家庭生活简朴但温馨。未来两年内，婚姻运势稳定，节俭持家。",  
            "health": "身体状况一般，需要节制养生。损卦象征减损，预示健康需要通过节制获得改善。建议控制饮食，避免暴饮暴食。适度运动，不要过度消耗体力。保持良好作息，避免熬夜。未来一年内，健康运势通过节制可改善，宜合理养生。",  
            "lifespan": "寿命中等，通过节制可改善。损卦主适度减损，预示通过合理的养生节制可以改善健康状况。建议建立科学的饮食和运动节制计划。60岁以前需养成良好的节制习惯。总体寿命预测在72-79岁，通过节制养生可延长寿命。"  
        }  
    },  
    "42": {  
        "name": "益",  
        "hexagram": "☴☳",  
        "chinese_name": "益",  
        "english_name": "Increase",  
        "image": "益：利有攸往，利涉大川。",  
        "judgment": "益：利有攸往，利涉大川。",  
        "image_comment": "风雷，益；君子以见善则迁，有过则改。",  
        "lines": {  
            "初九": "初九：利用为大作，元吉，无咎。",  
            "六二": "六二：或跃在渊，乾道乃革，益用师。",  
            "六三": "六三：益之用凶事，无咎。有孚中行，告公用圭。",  
            "六四": "六四：中行，告公从，利用为依迁国。",  
            "九五": "九五：有孚惠心，勿问元吉。有孚惠我德。",  
            "上九": "上九：莫益之，或击之，立心勿恒，凶。"  
        },  
        "interpretation": {  
            "fortune": "益卦象征增益发展，稳步提升。时运方面显示您当前处于稳步上升的阶段，积极进取将获得更多收益。建议抓住机遇，扩大发展规模。未来半年内，发展势头良好，收益明显。总体运势为大吉，关键在于积极进取，合理利用机遇，才能获得持续的增益和发展。",  
            "wealth": "财运旺盛，收益明显增加。益卦主增益，预示财务状况持续改善，可能获得投资回报或额外收入。建议适度扩大投资，积极寻找增收机会。近期财运良好，宜大胆决策。未来一年内，财运指数85分，财富稳步增长，积极经营是关键。",  
            "career": "职业发展顺利，能力获得认可。益卦象征增益，预示职场中您将获得更多机会和资源支持。建议积极展现能力，争取更多责任。领导器重有发展潜力的员工。未来一年内，职业运势极佳，可能获得晋升、加薪或重要项目机会。",  
            "marriage": "感情关系改善，家庭和谐。益卦主增益，预示感情关系获得改善，家庭生活幸福。单身者桃花运旺，感情发展顺利。已婚者夫妻感情加深，家庭和睦。建议积极经营感情，增进夫妻关系。未来两年内，婚姻运势良好，家庭幸福指数88分。",  
            "health": "身体状况好转，精力恢复。益卦象征增益，预示健康状况改善，精力逐渐恢复。建议保持积极的生活态度，继续健康习惯。适当增加运动量，增强体质。保持良好心态，增强抵抗力。未来一年内，健康运势良好，积极调理是关键。",  
            "lifespan": "寿命较长，健康持续改善。益卦主增益发展，预示通过积极养生，健康状况将持续改善。建议保持积极的生活方式，继续科学养生。60岁以后可增加养生投入，享受高品质健康服务。总体寿命预测在80-87岁，积极养生有助于长寿。"  
        }  
    },  
    "43": {  
        "name": "夬",  
        "hexagram": "☱☰",  
        "chinese_name": "夬",  
        "english_name": "Breakthrough",  
        "image": "夬：扬于王庭，孚号，有厉，告自邑，不利即戎，利有攸往。",  
        "judgment": "夬：扬于王庭，孚号，有厉，告自邑，不利即戎，利有攸往。",  
        "image_comment": "泽上于天，夬；君子以施禄及下，居德则忌。",  
        "lines": {  
            "初九": "初九：壮于前趾，往不胜，为咎。",  
            "九二": "九二：惕号，莫夜有戎，勿恤。",  
            "九三": "九三：壮于頄，有凶。君子夬夬独行，遇雨若濡，有愠无咎。",  
            "九四": "九四：臀无肤，其行次且，牵羊悔亡，闻言不信。",  
            "九五": "九五：苋陆夬夬，中行无咎。",  
            "上六": "上六：无号，终有凶。"  
        },  
        "interpretation": {  
            "fortune": "夬卦象征决断果敢，坚决除恶。时运方面显示您当前需要果断决策，清除障碍。建议勇于决断，大胆行动。未来半年内，通过果断决策将获得重大突破。总体运势为大吉，关键在于坚决果断，及时清除阻碍，才能获得彻底的胜利和发展机会。",  
            "wealth": "财运好转，需要果断决策。夬卦主决断，预示通过果断的财务决策可以改善经济状况。建议及时止损不良投资，果断调整理财策略。近期可能需要做出重要财务决策。未来一年内，财运指数75分，果断行动将带来经济好转。",  
            "career": "工作需要果断处理问题。夬卦象征决断，预示职场中需要果断解决矛盾和问题。建议大胆提出解决方案，坚决执行。领导欣赏有决断力的员工。未来一年内，职业运势向好，通过果断决策可能获得晋升或重要项目成功。",  
            "marriage": "感情关系需要果断处理。夬卦主决断，预示感情中需要果断解决矛盾和问题。单身者需果断结束不合适的关系。已婚者需坚决处理婚姻危机，避免拖延。建议勇于面对感情问题，果断决策。未来两年内，婚姻运势改善，需要果断行动。",  
            "health": "身体状况需要果断治疗。夬卦象征决断，预示健康问题需要果断治疗，不要拖延。建议立即就医，积极配合治疗。保持良好心态，坚决执行医嘱。注意预防疾病恶化，及时处理健康问题。未来一年内，健康运势好转，果断治疗是关键。",  
            "lifespan": "寿命中等，通过果断治疗可改善。夬卦主果断决断，预示通过果断的健康管理可以改善寿命。建议重视早期治疗，不要拖延病情。建立果断的健康决策机制。总体寿命预测在73-80岁，通过果断治疗可延长寿命。"  
        }  
    },  
    "44": {  
        "name": "姤",  
        "hexagram": "☰☴",  
        "chinese_name": "姤",  
        "english_name": "Coming to Meet",  
        "image": "姤：女壮，勿用取女。",  
        "judgment": "姤：女壮，勿用取女。",  
        "image_comment": "天下有风，姤；后以施命诰四方。",  
        "lines": {  
            "初六": "初六：系于金柅，贞吉。有攸往，见凶，羸豕孚蹢。",  
            "九二": "九二：包有鱼，无咎，不利宾。",  
            "九三": "九三：臀无肤，其行次且，牵羊悔亡，闻言不信。",  
            "九四": "九四：包无鱼，起凶。",  
            "九五": "九五：以杞包瓜，含章，有陨自天。",  
            "上九": "上九：姤其角，吝，无咎。"  
        },  
        "interpretation": {  
            "fortune": "姤卦象征相遇短暂，需谨慎交往。时运方面显示您当前可能遇到短暂机遇或人际关系。建议谨慎选择，避免盲目交往。未来半年内，人际关系多变，需要明辨是非。总体运势为中下，关键在于谨慎选择，保持清醒，避免因短暂相遇造成损失。",  
            "wealth": "财运一般，合作需谨慎。姤卦主短暂相遇，预示商业合作可能短暂不稳定。建议避免长期大额合作，选择短期项目。近期可能有短暂投资机会，但风险较高。未来一年内，财运指数55分，宜谨慎合作，避免因短暂关系造成经济损失。",  
            "career": "工作机会短暂，需要谨慎选择。姤卦象征短暂，预示职场机会可能转瞬即逝。建议快速判断，选择真正有价值的机会。避免盲目跳槽或合作。保持现有稳定工作。未来一年内，职业运势波动，需要明辨职场机会的真伪。",  
            "marriage": "感情关系短暂，需谨慎发展。姤卦主短暂相遇，预示感情可能发展迅速但不稳定。单身者需谨慎选择，避免冲动恋爱。已婚者需警惕第三者干扰，巩固婚姻关系。建议保持清醒，不要被短暂激情迷惑。未来两年内，婚姻运势需谨慎。",  
            "health": "身体状况一般，注意突发疾病。姤卦象征短暂，预示可能出现短暂但严重的健康问题。建议保持警惕，注意预防突发疾病。保持良好生活习惯，避免冒险行为。定期体检，关注身体信号。未来一年内，健康运势一般，需注意突发状况。",  
            "lifespan": "寿命中等，需注意突发健康问题。姤卦主短暂相遇，预示可能存在突发健康风险。建议建立完善的医疗保障，保持警惕。60岁以前需特别关注心脑血管健康，避免突发疾病。总体寿命预测在70-77岁，通过预防可改善健康状况。"  
        }  
    },  
    "45": {  
        "name": "萃",  
        "hexagram": "☱☷",  
        "chinese_name": "萃",  
        "english_name": "Gathering Together",  
        "image": "萃：亨，王假有庙，利见大人，亨，利贞。用大牲吉，利有攸往。",  
        "judgment": "萃：亨，王假有庙，利见大人，亨，利贞。用大牲吉，利有攸往。",  
        "image_comment": "泽上于地，萃；君子以除戎器，戎不虞。",  
        "lines": {  
            "初六": "初六：有孚不终，乃乱乃萃，若号，一握为笑，勿恤，往无咎。",  
            "六二": "六二：引吉，无咎，孚乃利用禴。",  
            "六三": "六三：萃如嗟如，无攸利，往无咎，小吝。",  
            "九四": "九四：大吉，无咎。",  
            "九五": "九五：萃有位，无咎。匪孚，元永贞，悔亡。",  
            "上六": "上六：赍咨涕洟，未安上也。"  
        },  
        "interpretation": {  
            "fortune": "萃卦象征聚集聚合，团结协作。时运方面显示您当前人脉汇聚，利于团队合作。建议积极组织活动，建立合作关系。未来半年内，合作机会增多，团队力量强大。总体运势为大吉，关键在于团结协作，发挥集体智慧，才能获得重大成功和发展。",  
            "wealth": "财运亨通，利于团队投资。萃卦主聚集，预示通过团队合作获得丰厚商业回报。建议组建商业联盟，共同开发项目。近期可能有大型合作机会。未来一年内，财运指数82分，团队合作将带来巨大经济效益。",  
            "career": "工作顺利，团队力量强大。萃卦象征团结，预示职场中团队合作顺利，集体力量强大。建议加强团队建设，发挥组织协调能力。领导重视团队合作。未来一年内，职业运势极佳，可能领导大型团队项目，获得集体荣誉。",  
            "marriage": "家庭和睦，亲友关系良好。萃卦主聚集，预示家庭成员关系融洽，亲友聚会频繁。单身者通过社交活动容易遇到合适对象。已婚者家庭生活热闹，亲友支持。建议多组织家庭聚会，增进亲友关系。未来两年内，婚姻运势良好，家庭幸福。",  
            "health": "身体状况良好，集体活动有益。萃卦象征聚集，预示通过集体活动保持良好状态。建议多参加团队运动，增强体质。注意群体卫生，避免传染病。保持良好社交生活，缓解心理压力。未来一年内，健康运势良好，社交活跃有益健康。",  
            "lifespan": "寿命较长，社交网络支持。萃卦主聚集团结，预示广泛的社交网络和家庭支持有助于健康长寿。建议保持活跃的社交生活，建立支持系统。60岁以后参与社区活动，保持生活充实。总体寿命预测在80-87岁，社交支持对长寿重要。"  
        }  
    },  
    "46": {  
        "name": "升",  
        "hexagram": "☷☴",  
        "chinese_name": "升",  
        "english_name": "Pushing Upward",  
        "image": "升：元，亨，用见大人，勿恤，南征吉。",  
        "judgment": "升：元，亨，用见大人，勿恤，南征吉。",  
        "image_comment": "地中生木，升；君子以顺德，积小以高大。",  
        "lines": {  
            "初六": "初六：允升，大吉。",  
            "九二": "九二：孚乃利用禴，无咎。",  
            "九三": "九三：升虚邑。",  
            "六四": "六四：王用亨于岐山，吉，无咎。",  
            "六五": "六五：贞吉，升阶。",  
            "上六": "上六：冥升，利于不息之贞。"  
        },  
        "interpretation": {  
            "fortune": "升卦象征逐步上升，稳步发展。时运方面显示您当前处于稳步上升的阶段，坚持努力将获得成功。建议脚踏实地，逐步提升。未来半年内，发展稳定向上。总体运势为大吉，关键在于持之以恒，积小胜为大胜，稳步上升才能获得长久成功。",  
            "wealth": "财运稳定增长，稳步积累。升卦主逐步上升，预示财务状况稳定改善，通过持续努力获得收益。建议制定长期理财计划，坚持执行。近期收入稳定，适合稳步投资。未来一年内，财运指数78分，稳步积累，厚积薄发。",  
            "career": "职业发展稳定，逐步晋升。升卦象征上升，预示职场中您将获得稳步发展机会。建议专注专业提升，积累经验。领导欣赏踏实努力的员工。未来一年内，职业运势良好，可能获得逐步晋升或重要项目参与机会。",  
            "marriage": "感情关系稳定，逐步加深。升卦主逐步发展，预示感情需要慢慢培养，逐步加深。单身者感情发展缓慢但稳定。已婚者家庭生活平淡但温馨。建议保持耐心，稳步增进感情。未来两年内，婚姻运势良好，稳定发展。",  
            "health": "身体状况稳定，逐步改善。升卦象征上升，预示健康状况通过持续调理逐步改善。建议坚持健康习惯，保持规律生活。适当增加运动量，增强体质。保持良好心态，稳步提升健康水平。未来一年内，健康运势稳定向上，积极调理。",  
            "lifespan": "寿命较长，稳步养生有效。升卦主逐步上升，预示通过持续的养生习惯可以逐步改善健康状况。建议建立长期的养生计划，坚持执行。60岁以后继续保持良好习惯，稳步养生。总体寿命预测在78-85岁，持续养生有助于长寿。"  
        }  
    },  
    "47": {  
        "name": "困",  
        "hexagram": "☱☵",  
        "chinese_name": "困",  
        "english_name": "Oppression",  
        "image": "困：亨，贞，大人吉，无咎。有言不信。",  
        "judgment": "困：亨，贞，大人吉，无咎。有言不信。",  
        "image_comment": "泽无水，困；君子以致命遂志。",  
        "lines": {  
            "初六": "初六：臀困于株木，入于幽谷，三岁不觏。",  
            "九二": "九二：困于酒食，朱绤方来，利用享祀，征凶，无咎。",  
            "六三": "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。",  
            "九四": "九四：来徐徐，困于金车，吝，有终。",  
            "九五": "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。",  
            "上六": "上六：困于葛藟，于臲卼，曰动悔。有悔，征吉。"  
        },  
        "interpretation": {  
            "fortune": "困卦象征困境重围，艰难困苦。时运方面显示您当前处于重重困境之中，举步维艰。建议保持坚韧意志，寻求出路。未来半年内，困境持续，需要强大内心。总体运势为大凶，关键在于不屈不挠，保持希望，积极寻找出路，才能最终摆脱困境。",  
            "wealth": "财运极差，经济困境严重。困卦主困苦，预示财务状况陷入困境，可能资不抵债。建议紧急求助，寻求财务援助。控制所有开支，保护最后资产。未来一年内，财运指数25分，经济危机，需要家人支持和外部援助度过难关。",  
            "career": "工作陷入困境，发展停滞。困卦象征受困，预示职场中面临严重危机，可能失业或严重降职。建议保持低调，寻找内部调整或外部机会。利用困境学习新技能。未来一年内，职业运势极差，需要重新规划职业生涯。",  
            "marriage": "感情关系危机，面临破裂。困卦主困境，预示婚姻可能面临严重考验，甚至离婚危机。单身者感情运极差，不宜发展关系。已婚者需共同面对困难，避免互相指责。建议寻求婚姻咨询，挽救婚姻关系。未来两年内，婚姻运势低谷。",  
            "health": "身体状况危急，疾病缠身。困卦象征重病，预示健康状况极差，可能面临多种疾病。建议立即就医，全力治疗。注意心理健康，避免绝望情绪。家人支持对康复至关重要。未来一年内，健康运势极差，需要全力治疗和康复。",  
            "lifespan": "寿命面临极大威胁，紧急治疗。困卦主严重困境，预示健康危机可能严重影响寿命。建议立即调整生活方式，积极治疗。建立完善的医疗保障和支持系统。总体寿命预测在58-65岁，通过积极治疗和家人支持可有所改善。"  
        }  
    },  
    "48": {  
        "name": "井",  
        "hexagram": "☵☷",  
        "chinese_name": "井",  
        "english_name": "The Well",  
        "image": "井：改邑不改井，无丧无得，往来井井。汔至亦未繘井，羸其瓶，凶。",  
        "judgment": "井：改邑不改井，无丧无得，往来井井。汔至亦未繘井，羸其瓶，凶。",  
        "image_comment": "木上有水，井；君子以劳民劝相。",  
        "lines": {  
            "初六": "初六：井泥不食，旧井无禽。",  
            "九二": "九二：井谷射鲋，瓮漏。",  
            "九三": "九三：井渫不食，为我心恻，可用汲，王明，并受其福。",  
            "六四": "六四：井甃，无咎。",  
            "九五": "九五：井洌，寒泉食。",  
            "上六": "上六：井收，勿幕，有孚，元吉。"  
        },  
        "interpretation": {  
            "fortune": "井卦象征水井不迁，源远流长。时运方面显示您当前需要稳定发展，深挖潜力。建议专注核心业务，稳步发展。未来半年内，稳定发展将获得长久回报。总体运势为中吉，关键在于深挖潜力，保持稳定，才能获得源源不断的成功和发展机会。",  
            "wealth": "财运稳定，利于长期经营。井卦主稳定不迁，预示通过稳定经营获得持续收益。建议专注主业，避免频繁变动。近期收入稳定，适合长期投资规划。未来一年内，财运指数70分，稳定经营是获得长期财富的关键。",  
            "career": "职业发展稳定，稳步提升。井卦象征稳定，预示职场中需要专注专业发展，稳步提升。建议深耕现有领域，成为行业专家。领导欣赏专注的员工。未来一年内，职业运势良好，可能获得专业领域的认可和晋升机会。",  
            "marriage": "家庭稳定，关系长久。井卦主稳定持久，预示婚姻关系稳定，感情深厚。单身者宜寻找稳定可靠的对象。已婚者家庭生活平淡但温馨。建议保持稳定的家庭生活，建立长期的家庭规划。未来两年内，婚姻运势良好，稳定幸福。",  
            "health": "身体状况稳定，养生见效。井卦象征稳定，预示通过持续养生获得健康改善。建议保持稳定的养生习惯，坚持健康生活方式。建立长期的健康管理计划。保持均衡饮食，适度运动。未来一年内，健康运势稳定，持续养生是关键。",  
            "lifespan": "寿命较长，稳定养生有效。井卦主稳定持久，预示通过稳定的养生习惯可以获得健康长寿。建议建立科学的长期养生计划，坚持执行。60岁以后继续保持稳定习惯，定期体检。总体寿命预测在78-85岁，稳定养生有助于长寿。"  
        }  
    },  
    "49": {  
        "name": "革",  
        "hexagram": "☱☲",  
        "chinese_name": "革",  
        "english_name": "Revolution",  
        "image": "革：己日乃孚，元亨，利贞，悔亡。",  
        "judgment": "革：己日乃孚，元亨，利贞，悔亡。",  
        "image_comment": "泽中有火，革；君子以治历明时。",  
        "lines": {  
            "初九": "初九：鞏用黄牛之革。",  
            "六二": "六二：己日乃革之，征吉，无咎。",  
            "九三": "九三：征凶，贞厉。革言三就，有孚。",  
            "九四": "九四：悔亡，有孚改命，吉。",  
            "九五": "九五：大人虎变，未占有孚。",  
            "上六": "上六：君子豹变，小人革面，征凶，居贞吉。"  
        },  
        "interpretation": {  
            "fortune": "革卦象征变革革新，彻底变革。时运方面显示您当前需要大胆变革，清除旧有弊端。建议勇于创新，彻底改革。未来半年内，变革将带来重大发展。总体运势为大吉，关键在于时机成熟时果断变革，彻底清除旧弊，才能迎来新的发展时代。",  
            "wealth": "财运好转，需要商业变革。革卦主革新，预示通过商业模式创新获得新的财源。建议大胆改革现有商业模式，开发新产品或服务。近期变革投资可能有风险但回报丰厚。未来一年内，财运指数80分，变革创新是获得财富增长的关键。",  
            "career": "职业需要变革创新。革卦象征革新，预示职场中需要大胆创新，改变现有工作模式。建议提出改革建议，勇于尝试新方法。领导支持有创新能力的员工。未来一年内，职业运势极佳，通过创新可能获得重大突破和晋升机会。",  
            "marriage": "感情关系需要变革调整。革卦主变革，预示婚姻中需要改变现有模式，调整夫妻关系。单身者宜改变择偶观念，寻找新类型对象。已婚者需改革家庭生活方式，改善夫妻关系。建议勇于改变，打破旧有模式。未来两年内，婚姻运势好转。",  
            "health": "身体状况需要变革调理。革卦象征革新，预示健康需要改变现有生活方式，积极调理。建议彻底改变不良生活习惯，建立健康生活模式。学习新的养生方法，勇于尝试。保持变革决心，坚持健康生活。未来一年内，健康运势好转，变革是关键。",  
            "lifespan": "寿命可通过变革改善。革卦主彻底变革，预示通过生活方式的彻底变革可以显著改善健康状况。建议勇于改变不良习惯，建立科学的生活方式。60岁以前需进行健康生活方式的革新。总体寿命预测在75-82岁，生活变革对寿命至关重要。"  
        }  
    },  
    "50": {  
        "name": "鼎",  
        "hexagram": "☲☷",  
        "chinese_name": "鼎",  
        "english_name": "The Cauldron",  
        "image": "鼎：元，吉，亨。",  
        "judgment": "鼎：元，吉，亨。",  
        "image_comment": "火伏于木上，鼎；君子以正位凝命。",  
        "lines": {  
            "初六": "初六：鼎颠趾，利出否，得妾以其子，无咎。",  
            "九二": "九二：鼎有实，我仇有疾，不我能即，吉。",  
            "九三": "九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。",  
            "九四": "九四：鼎折足，覆公觶，其形渥，凶。",  
            "六五": "六五：鼎黄耳金铉，利贞。",  
            "上九": "上九：鼎玉铉，大吉，无不利。"  
        },  
        "interpretation": {  
            "fortune": "鼎卦象征鼎盛稳定，成就辉煌。时运方面显示您当前处于事业鼎盛的阶段，地位稳定。建议保持稳定发展，巩固现有成果。未来半年内，发展稳定，声望提升。总体运势为大吉，关键在于稳固根基，保持鼎盛状态，才能获得长久的成功和荣耀。",  
            "wealth": "财运稳定，经济状况良好。鼎卦主鼎盛，预示财务状况稳定富足，经济基础坚实。建议巩固现有财富，适度投资稳定项目。近期收入稳定，适合财富保值。未来一年内，财运指数82分，经济稳定，宜保持现有理财策略。",  
            "career": "职业地位稳定，成就显著。鼎卦象征鼎盛，预示职场中您将获得重要地位和成就。领导器重，团队稳定。建议巩固现有职位，继续发挥专长。未来一年内，职业运势极佳，可能获得高层管理职位或行业权威地位。",  
            "marriage": "婚姻稳定，家庭富足美满。鼎卦主鼎盛，预示家庭经济稳定，夫妻关系和谐。单身者有望建立稳定美满的家庭。已婚者家庭生活富足，地位稳定。建议保持家庭和谐，继续经营好家庭关系。未来两年内，婚姻运势极佳，家庭幸福指数90分。",  
            "health": "身体状况良好，稳定健康。鼎卦象征稳定，预示健康状况良好，体质稳定。建议保持现有健康习惯，继续规律生活。巩固健康基础，避免健康波动。保持良好心态，稳定养生。未来一年内，健康运势极好，稳定是关键。",  
            "lifespan": "寿命长久，晚年生活富足。鼎卦主鼎盛稳定，预示您将获得长期的健康保障和经济支持。建议保持稳定的养生习惯，建立长期健康计划。60岁以后经济条件优越，可享受高品质医疗服务。总体寿命预测在82-89岁，稳定生活有助于长寿。"  
        }  
    },  
    "51": {  
        "name": "震",  
        "hexagram": "☳☳",  
        "chinese_name": "震",  
        "english_name": "The Arousing",  
        "image": "震：亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。",  
        "judgment": "震：亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。",  
        "image_comment": "洊雷震，君子以恐惧修省。",  
        "lines": {  
            "初九": "初九：震来虩虩，后笑言哑哑，吉。",  
            "六二": "六二：震来，厉，亿丧贝，跻于九陵，勿逐，七日得。",  
            "六三": "六三：震苏苏，震行无眚。",  
            "九四": "九四：震遂泥。",  
            "六五": "六五：震往来厉，亿无丧，有事。",  
            "上六": "上六：震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。"  
        },  
        "interpretation": {  
            "fortune": "震卦象征震动惊惧，积极变革。时运方面显示您当前将经历重大变动和挑战，需要保持冷静。建议积极应对变化，化挑战为机遇。未来半年内，环境剧变，需要快速适应。总体运势为中上，关键在于临危不惧，抓住变革机遇，才能在震动中获得新的发展。",  
            "wealth": "财运波动，变革带来机遇。震卦主震动，预示财务环境剧变，可能面临风险但也蕴藏机遇。建议灵活调整投资策略，抓住变革机会。近期可能有意外支出，但也有突发收益。未来一年内，财运指数70分，变革中寻找投资机会。",  
            "career": "工作环境剧变，需要快速适应。震卦象征震动，预示职场中可能发生重大变化，如组织调整或岗位变动。建议保持灵活性，积极适应新环境。领导需要能快速适应变化的员工。未来一年内，职业运势波动，通过适应变化可获得新机会。",  
            "marriage": "感情关系面临考验，需要共同面对。震卦主震动，预示家庭可能面临突发事件或变化。单身者感情发展不稳定，需谨慎选择。已婚者需共同面对困难，增进夫妻感情。建议保持沟通，共同应对变化。未来两年内，婚姻运势考验，需要共同努力。",  
            "health": "身体状况波动，注意突发疾病。震卦象征震动，预示可能出现突发健康问题。建议保持警惕，注意预防意外伤害。保持良好体质，增强抗风险能力。定期体检，关注身体异常信号。未来一年内，健康运势波动，需特别注意安全。",  
            "lifespan": "寿命中等，突发事件需防范。震卦主剧烈变化，预示可能面临突发健康风险。建议建立完善的医疗保障，保持警惕。60岁以前需特别关注意外伤害预防。总体寿命预测在70-77岁，通过风险防范可改善健康状况。"  
        }  
    },  
    "52": {  
        "name": "艮",  
        "hexagram": "☶☶",  
        "chinese_name": "艮",  
        "english_name": "Keeping Still",  
        "image": "艮：艮其背，不获其身，行其庭不见其人，无咎。",  
        "judgment": "艮：艮其背，不获其身，行其庭不见其人，无咎。",  
        "image_comment": "兼山，艮；君子以思不出其位。",  
        "lines": {  
            "初六": "初六：艮其趾，无咎，利永贞。",  
            "六二": "六二：艮其腓，不拯其随，其心不快。",  
            "九三": "九三：艮其限，列其随，志穷凶。",  
            "六四": "六四：艮其身，无咎。",  
            "六五": "六五：艮其辅，言有序，悔亡。",  
            "上九": "上九：敦艮，吉。"  
        },  
        "interpretation": {  
            "fortune": "艮卦象征静止止于正道，守正不阿。时运方面显示您当前需要保持稳定，坚守正道。建议专注现有事务，避免盲目扩张。未来半年内，稳定发展将获得长久利益。总体运势为中吉，关键在于守正静养，保持稳定，才能在动荡环境中获得长久成功。",  
            "wealth": "财运稳定，利于守成为主。艮卦主静止，预示财务状况稳定，不宜大动作投资。建议保持现有理财策略，专注现金流管理。近期收入稳定，适合储蓄保值。未来一年内，财运指数68分，稳定理财是获得长久财富的关键。",  
            "career": "职业发展稳定，需要专注专业。艮卦象征静守，预示职场中需要专注现有岗位，深耕专业领域。建议避免频繁跳槽，专注技能提升。领导欣赏专注的员工。未来一年内，职业运势平稳，可能在专业领域获得认可和稳定发展。",  
            "marriage": "家庭生活稳定，关系平淡温馨。艮卦主静止，预示婚姻关系稳定，但缺乏激情。单身者感情发展缓慢，需耐心等待。已婚者家庭生活平淡，需创造小惊喜。建议保持稳定的家庭生活，注重日常小事。未来两年内，婚姻运势稳定，平淡幸福。",  
            "health": "身体状况稳定，适合静养调理。艮卦象征静止，预示健康状况平稳，适合进行养生调理。建议保持规律生活，避免剧烈运动。学习静坐冥想，调理身心。保持良好心态，稳定养生。未来一年内，健康运势稳定，静养有益。",  
            "lifespan": "寿命较长，稳定养生有效。艮卦主静守正道，预示通过稳定的养生习惯可以获得健康长寿。建议建立规律的养生计划，坚持执行。60岁以后保持稳定的生活节奏，定期体检。总体寿命预测在78-85岁，稳定养生有助于长寿。"  
        }  
    },  
    "53": {  
        "name": "渐",  
        "hexagram": "☶☴",  
        "chinese_name": "渐",  
        "english_name": "Development",  
        "image": "渐：女归吉，利贞。",  
        "judgment": "渐：女归吉，利贞。",  
        "image_comment": "山上有木，渐；君子以居贤德善俗。",  
        "lines": {  
            "初六": "初六：鸿渐于干，小子厉，有言，无咎。",  
            "六二": "六二：鸿渐于磐，饮食衎衎，吉。",  
            "九三": "九三：鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。",  
            "六四": "六四：鸿渐于木，或得其桷，无咎。",  
            "九五": "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。",  
            "上九": "上九：鸿渐于陆，其羽可用为仪，吉。"  
        },  
        "interpretation": {  
            "fortune": "渐卦象征渐进发展，稳步前进。时运方面显示您当前需要循序渐进，稳步发展。建议制定长期规划，逐步实现目标。未来半年内，进展缓慢但稳定。总体运势为中吉，关键在于坚持不懈，循序渐进，才能获得稳步发展和长久成功。",  
            "wealth": "财运稳定增长，稳步积累。渐卦主渐进，预示财务状况通过持续努力获得稳定增长。建议制定长期理财计划，坚持执行。近期收入稳定，适合稳步投资。未来一年内，财运指数72分，循序渐进的理财策略将获得可观回报。",  
            "career": "职业发展稳定，逐步提升。渐卦象征渐进，预示职场中需要稳步提升，积累经验。建议专注专业技能学习，逐步晋升。领导欣赏踏实努力的员工。未来一年内，职业运势良好，可能获得稳步晋升或项目进展机会。",  
            "marriage": "感情关系稳定，逐步加深。渐卦主渐进发展，预示感情需要慢慢培养，逐步加深。单身者感情发展缓慢但有希望。已婚者家庭生活平淡温馨。建议保持耐心，稳步增进感情。未来两年内，婚姻运势良好，稳定发展中。",  
            "health": "身体状况稳定，逐步改善。渐卦象征渐进，预示健康状况通过持续调理逐步改善。建议坚持健康习惯，保持规律生活。循序渐进地增加运动量，改善体质。保持良好心态，稳步提升健康水平。未来一年内，健康运势稳定向上。",  
            "lifespan": "寿命较长，渐进养生有效。渐卦主循序渐进，预示通过持续不断的养生习惯可以逐步改善健康状况。建议建立长期的养生计划，逐步执行。60岁以后继续保持渐进式养生。总体寿命预测在77-84岁，持续养生有助于长寿。"  
        }  
    },  
    "54": {  
        "name": "归妹",  
        "hexagram": "☴☱",  
        "chinese_name": "归妹",  
        "english_name": "The Marrying Maiden",  
        "image": "归妹：征凶，无攸利。",  
        "judgment": "归妹：征凶，无攸利。",  
        "image_comment": "泽上于山，归妹；君子以永终知敝。",  
        "lines": {  
            "初九": "初九：归妹以娣，跛能履，征吉。",  
            "九二": "九二：眇能视，利幽人之贞。",  
            "六三": "六三：归妹以须，反归以娣。",  
            "九四": "九四：归妹愆期，迟归有时。",  
            "六五": "六五：帝乙归妹，其君之袂，不如其娣之袂良。月几望，吉。",  
            "上六": "上六：女承筐无实，士刲羊无血，无攸利。"  
        },  
        "interpretation": {  
            "fortune": "归妹卦象征嫁妹不正，关系混乱。时运方面显示您当前人际关系复杂，需要谨慎处理。建议明辨是非，避免卷入复杂关系。未来半年内，关系纠葛多，需要保持清醒。总体运势为中下，关键在于洁身自好，避免不正当关系，才能避免麻烦和损失。",  
            "wealth": "财运一般，合作关系复杂。归妹卦主关系混乱，预示商业合作可能出现利益纠葛。建议避免复杂的合伙关系，选择清晰的合作模式。近期可能有合作纠纷，需要谨慎处理。未来一年内，财运指数55分，宜独立经营，避免关系复杂化。",  
            "career": "工作关系复杂，需要谨慎。归妹卦象征混乱，预示职场中人际关系复杂，可能出现利益冲突。建议保持职业操守，避免办公室政治。专注工作业绩，不要卷入复杂关系。未来一年内，职业运势一般，需要明哲保身，专注专业。",  
            "marriage": "感情关系复杂，需谨慎处理。归妹卦主嫁娶不正，预示感情关系可能出现第三者或不正当关系。单身者需谨慎选择，避免复杂感情。已婚者需警惕婚姻危机，保持忠贞。建议洁身自好，避免感情纠葛。未来两年内，婚姻运势复杂，需要谨慎。",  
            "health": "身体状况一般，关系压力影响。归妹卦象征关系混乱，预示人际关系复杂可能导致心理压力。建议保持良好心态，避免因人际关系导致焦虑。注意神经系统健康，适当放松。保持健康生活方式，缓解压力。未来一年内，健康运势一般，心理健康需关注。",  
            "lifespan": "寿命中等，关系问题需注意。归妹卦主关系混乱，预示复杂的人际关系可能影响心理健康。建议建立清晰的人际界限，避免不必要纠葛。60岁以前需保持健康的人际关系。总体寿命预测在70-77岁，通过改善人际关系可延长寿命。"  
        }  
    },  
    "55": {  
        "name": "丰",  
        "hexagram": "☲☳",  
        "chinese_name": "丰",  
        "english_name": "Abundance",  
        "image": "丰：亨，王假之。勿忧，宜日中。",  
        "judgment": "丰：亨，王假之。勿忧，宜日中。",  
        "image_comment": "雷电皆至，丰；君子以折狱致刑。",  
        "lines": {  
            "初九": "初九：遇其配主，虽旬无咎，往有尚。",  
            "六二": "六二：丰其腓，凶，无攸利。",  
            "九三": "九三：丰其沛，日中见沫，与其邻王，征凶，无攸利。",  
            "九四": "九四：丰其蔀，日中见斗，往遇其夷主，吉。",  
            "六五": "六五：来章，有庆誉，吉。",  
            "上六": "上六：丰其屋，蔀其家，窥其户，阒其无人，自藏也。窥其户，阒其无人，三岁不觏，凶。"  
        },  
        "interpretation": {  
            "fortune": "丰卦象征丰盛鼎盛，辉煌一时。时运方面显示您当前处于人生巅峰，事业丰收。建议充分利用时机，扩大发展。未来半年内，发展势头强劲，成果丰硕。总体运势为大吉，关键在于抓住时机，扩大成果，但需注意适度，避免因过度扩张导致衰落。",  
            "wealth": "财运极佳，财富丰收。丰卦主丰盛，预示财务状况达到高峰，可能获得大额收益和投资回报。建议合理规划财富，适度投资高增长项目。近期财运旺盛，宜大胆拓展业务。未来一年内，财运指数92分，财富丰收，但需注意风险管理。",  
            "career": "事业辉煌，成就显著。丰卦象征鼎盛，预示职场中您将获得重大成功和荣誉。领导器重，团队出色。建议带领团队创造更大成就，积极争取行业地位。未来一年内，职业运势极佳，可能获得高层职位或行业领袖地位。",  
            "marriage": "婚姻美满，家庭富足。丰卦主丰盛，预示家庭经济极佳，夫妻关系和谐美满。单身者有望遇到经济条件优越的对象。已婚者家庭生活奢华，子女优秀。建议合理规划家庭财富，保持家庭和谐。未来两年内，婚姻运势极佳，家庭幸福指数93分。",  
            "health": "身体状况极佳，精力充沛。丰卦象征丰盛，预示体质强健，精力旺盛。建议保持高强度工作，但注意劳逸结合。适当进行全面体检，保持健康状态。注意预防过度劳累导致的健康问题。未来一年内，健康运势极好，但需合理安排作息。",  
            "lifespan": "寿命长久，晚年生活奢华。丰卦主鼎盛丰收，预示您将获得长期的财富积累和健康保障。建议保持积极的生活方式，继续发展事业。60岁以后经济条件优越，可享受顶级医疗服务。总体寿命预测在85-92岁，丰盛生活有助于长寿。"  
        }  
    },  
    "56": {  
        "name": "旅",  
        "hexagram": "☲☶",  
        "chinese_name": "旅",  
        "english_name": "The Wanderer",  
        "image": "旅：小亨，旅贞吉。",  
        "judgment": "旅：小亨，旅贞吉。",  
        "image_comment": "山上有火，旅；君子以明慎用刑，弗于亲见。",  
        "lines": {  
            "初六": "初六：旅琐琐，斯其所取灾。",  
            "六二": "六二：旅即次，怀其资，得童仆贞。",  
            "九三": "九三：旅焚其次，丧其童仆，贞厉。",  
            "九四": "九四：旅于处，得其资斧，我心不快。",  
            "六五": "六五：射雉，一矢亡，终以誉命。",  
            "上九": "上九：鸟焚其巢，旅人先笑后号咷，丧牛于易，凶。"  
        },  
        "interpretation": {  
            "fortune": "旅卦象征旅居在外，寄人篱下。时运方面显示您当前处于异地发展或环境不利的阶段。建议保持低调，谨慎行事。未来半年内，环境陌生，需要逐步适应。总体运势为中下，关键在于谨慎处世，结交有益朋友，逐步建立稳定基础，才能在异地获得发展。",  
            "wealth": "财运一般，需谨慎理财。旅卦主旅居，预示财务环境不稳定，需要谨慎管理。建议控制开支，避免大额投资。关注现金流，保持流动性。未来一年内，财运指数55分，在异地发展需谨慎理财，建立经济基础。",  
            "career": "工作环境陌生，需要适应。旅卦象征旅居，预示职场中处于新环境，需要时间适应。建议保持学习态度，结交职场朋友。领导观察新员工的适应能力。未来一年内，职业运势一般，需要逐步建立职场人脉和信任。",  
            "marriage": "感情关系受环境影响。旅卦主旅居在外，预示异地生活可能影响感情发展。单身者异地恋或相亲需谨慎。已婚者异地分居需保持沟通。建议利用现代通讯保持联系，维系感情。未来两年内，婚姻运势受环境影响，需要努力维持。",  
            "health": "身体状况一般，注意适应环境。旅卦象征旅居，预示新环境可能导致健康不适。建议注意饮食卫生，预防肠胃疾病。保持规律作息，逐步适应新环境。关注心理健康，避免孤独感。未来一年内，健康运势一般，需注意环境适应。",  
            "lifespan": "寿命中等，环境适应重要。旅卦主旅居在外，预示环境变化可能影响健康。建议在不同环境中保持健康习惯，建立适应能力。60岁以前需学会环境适应养生。总体寿命预测在70-77岁，通过良好适应可改善健康状况。"  
        }  
    },  
    "57": {  
        "name": "巽",  
        "hexagram": "☴☴",  
        "chinese_name": "巽",  
        "english_name": "The Gentle",  
        "image": "巽：小亨，利有攸往，利见大人。",  
        "judgment": "巽：小亨，利有攸往，利见大人。",  
        "image_comment": "随风，巽；君子以申命察言。",  
        "lines": {  
            "初六": "初六：进退，利武人之贞。",  
            "九二": "九二：巽在床下，用史巫纷若，吉，无咎。",  
            "九三": "九三：频巽，吝。",  
            "六四": "六四：悔亡，田获三品。",  
            "九五": "九五：贞吉悔亡，无不利。无初有终。先庚三日，后庚三日，吉。",  
            "上九": "上九：巽在床下，丧其资斧，贞凶。"  
        },  
        "interpretation": {  
            "fortune": "巽卦象征柔顺入微，循序渐进。时运方面显示您当前需要以柔克刚，循序渐进。建议保持谦和态度，逐步推进。未来半年内，进展缓慢但稳定。总体运势为中吉，关键在于柔顺有度，循序渐进，才能以柔克刚，获得长久的发展和成功。",  
            "wealth": "财运平稳，利于柔性经营。巽卦主柔顺，预示通过柔性管理获得稳定收益。建议采用温和的商业策略，避免强硬竞争。近期收入稳定，适合渐进式投资。未来一年内，财运指数70分，以柔克刚的经营策略将获得稳定回报。",  
            "career": "工作需要柔和沟通，逐步推进。巽卦象征柔顺，预示职场中需要良好的沟通技巧和协调能力。建议以柔和态度处理人际关系，逐步达成目标。领导欣赏善于沟通的员工。未来一年内，职业运势良好，沟通能力是成功关键。",  
            "marriage": "感情关系和谐，以柔克刚。巽卦主柔顺，预示婚姻中需要以柔和态度处理矛盾。单身者宜展现温柔体贴的一面。已婚者夫妻关系融洽，互相体谅。建议保持温和的沟通方式，避免争执。未来两年内，婚姻运势良好，和谐幸福。",  
            "health": "身体状况良好，柔性养生有效。巽卦象征柔顺，预示通过柔和的养生方式获得健康改善。建议学习瑜伽、太极等柔性运动。保持平和心态，柔性调理。避免剧烈运动，循序渐进养生。未来一年内，健康运势稳定，柔性养生有益。",  
            "lifespan": "寿命较长，柔性养生有效。巽卦主柔顺有度，预示通过柔和的养生方式可以获得健康长寿。建议学习柔性养生方法，如中医调理、瑜伽等。60岁以后保持柔和的生活方式。总体寿命预测在78-85岁，柔性养生有助于长寿。"  
        }  
    },  
    "58": {  
        "name": "兑",  
        "hexagram": "☱☱",  
        "chinese_name": "兑",  
        "english_name": "The Joyous",  
        "image": "兑：亨，利贞。",  
        "judgment": "兑：亨，利贞。",  
        "image_comment": "丽泽，兑；君子以朋友讲习。",  
        "lines": {  
            "初九": "初九：和兑，吉。",  
            "九二": "九二：孚兑，吉，悔亡。",  
            "六三": "六三：来兑，凶。",  
            "九四": "九四：商兑，未宁，介疾有喜。",  
            "九五": "九五：孚于剥，有厉。",  
            "上六": "上六：引兑。"  
        },  
        "interpretation": {  
            "fortune": "兑卦象征喜悦交流，愉悦和谐。时运方面显示您当前处于人际和谐、心情愉悦的阶段。建议积极社交，分享喜悦。未来半年内，人缘极佳，合作顺利。总体运势为大吉，关键在于保持乐观态度，积极交流，才能持续获得人际支持和事业发展。",  
            "wealth": "财运良好，社交带来商机。兑卦主喜悦交流，预示通过良好人际关系获得商业机会。建议积极拓展人脉，参加商务社交。近期可能通过朋友介绍获得投资机会。未来一年内，财运指数80分，人际交流是获得财富增长的关键。",  
            "career": "工作顺利，团队氛围愉快。兑卦象征和谐，预示职场中同事关系融洽，工作氛围良好。建议发挥沟通协调能力，增进团队合作。领导欣赏善于交流的员工。未来一年内，职业运势极佳，可能通过团队合作获得成功和晋升机会。",  
            "marriage": "感情甜蜜，交流频繁。兑卦主喜悦交流，预示夫妻感情甜蜜，沟通顺畅。单身者桃花运旺，容易遇到有趣的对象。已婚者家庭生活快乐，夫妻互动频繁。建议多安排约会和旅行，增进感情。未来两年内，婚姻运势极佳，幸福指数90分。",  
            "health": "身体状况良好，精神愉悦。兑卦象征喜悦，预示心理状态极佳，对身体健康有积极影响。建议保持乐观心态，积极社交。适当进行愉悦运动，如舞蹈、游泳等。保持良好睡眠，享受生活乐趣。未来一年内，健康运势极好，快乐生活有益健康。",  
            "lifespan": "寿命较长，乐观心态重要。兑卦主喜悦交流，预示积极乐观的心态和丰富社交生活有助于健康长寿。建议保持愉悦的生活态度，积极参与社交活动。60岁以后可学习舞蹈、音乐等艺术活动，保持活力。总体寿命预测在80-87岁，乐观心态是长寿关键。"  
        }  
    },  
    "59": {  
        "name": "涣",  
        "hexagram": "☴☵",  
        "chinese_name": "涣",  
        "english_name": "Dispersion",  
        "image": "涣：亨。王假有庙，利涉大川，利贞。",  
        "judgment": "涣：亨。王假有庙，利涉大川，利贞。",  
        "image_comment": "风行水上，涣；先王以享于帝立庙。",  
        "lines": {  
            "初六": "初六：用拯马壮，吉。",  
            "九二": "九二：涣奔其机，悔亡。",  
            "六三": "六三：涣其躬，无悔。",  
            "六四": "六四：涣其群，元吉。涣有丘，匪夷所思。",  
            "九五": "九五：涣汗其大号，涣王居，无咎。",  
            "上九": "上九：涣其血，去逖出，无咎。"  
        },  
        "interpretation": {  
            "fortune": "涣卦象征涣散离析，重新整合。时运方面显示您当前可能面临组织涣散或关系疏离。建议积极整合资源，重新凝聚力量。未来半年内，需要重建秩序和团队。总体运势为中吉，关键在于涣散中寻找机会，重新整合，才能化涣散为凝聚，获得新的发展。",  
            "wealth": "财运波动，需要资源整合。涣卦主涣散，预示财务资源可能分散，需要重新整合。建议清理无效投资，集中资源于核心项目。近期可能有资产调整和重组。未来一年内，财运指数65分，通过资源整合可改善财务状况。",  
            "career": "工作组织涣散，需要重建。涣卦象征离析，预示团队可能面临重组或人员流动。建议发挥领导力，重建团队凝聚力。领导需要整合团队力量。未来一年内，职业运势波动，通过团队重建可获得新的发展机会。",  
            "marriage": "家庭关系疏离，需要重新凝聚。涣卦主涣散，预示家庭成员关系疏远，需要重新建立联系。单身者感情发展不稳定，需重新调整择偶策略。已婚者需加强家庭沟通，重建家庭凝聚力。未来两年内，婚姻运势需要努力重建。",  
            "health": "身体状况波动，需要调理整合。涣卦象征涣散，预示健康状况可能不稳定，需要全面调理。建议进行全面体检，整合健康管理计划。保持均衡饮食，适度运动。注意心理健康，重建健康信心。未来一年内，健康运势通过调理可改善。",  
            "lifespan": "寿命中等，需要健康整合。涣卦主涣散重组，预示需要整合健康管理，重建养生体系。建议建立全面的健康管理计划，整合医疗资源。60岁以前需建立稳定的健康习惯。总体寿命预测在72-79岁，通过健康整合可改善寿命。"  
        }  
    },  
    "60": {  
        "name": "节",  
        "hexagram": "☵☱",  
        "chinese_name": "节",  
        "english_name": "Limitation",  
        "image": "节：亨。苦节不可贞。",  
        "judgment": "节：亨。苦节不可贞。",  
        "image_comment": "泽上有水，节；君子以制数度，议德行。",  
        "lines": {  
            "初九": "初九：不出户庭，无咎。",  
            "九二": "九二：不出门庭，凶。",  
            "六三": "六三：不节若，则嗟若，无咎。",  
            "六四": "六四：安节，亨。",  
            "九五": "九五：甘节，吉，往有尚。",  
            "上六": "上六：苦节，贞凶，悔亡。"  
        },  
        "interpretation": {  
            "fortune": "节卦象征节制有度，适度约束。时运方面显示您当前需要合理节制，避免过度。建议制定合理计划，有度地控制。未来半年内，节制将带来稳定发展。总体运势为中吉，关键在于适度节制，合理规划，才能避免过度消耗，获得平衡发展。",  
            "wealth": "财运需要节制消费。节卦主节制，预示需要控制开支，避免过度消费。建议制定严格预算，优先保障投资和储蓄。近期避免奢侈消费，专注理财。未来一年内，财运指数65分，通过节制消费可积累更多财富。",  
            "career": "工作需要合理安排时间。节卦象征节制，预示需要合理分配工作时间和精力。建议学会时间管理，提高工作效率。领导欣赏有规划能力的员工。未来一年内，职业运势平稳，通过合理节制可提高工作质量和效率。",  
            "marriage": "家庭生活需要合理节制。节卦主适度，预示家庭开支需要合理控制，避免过度消费。夫妻双方需共同制定家庭预算，合理规划。保持适度的家庭生活，避免过度奢华。未来两年内，婚姻运势稳定，节制持家促进家庭和谐。",  
            "health": "身体状况良好，节制养生有效。节卦象征适度，预示通过合理的养生节制获得健康改善。建议控制饮食，避免暴饮暴食。保持适度运动，不要过度消耗。建立科学的养生节制计划。未来一年内，健康运势稳定，适度节制有益健康。",  
            "lifespan": "寿命较长，节制养生关键。节卦主适度节制，预示通过合理的养生节制可以获得健康长寿。建议建立科学的饮食和运动节制计划。60岁以后严格控制生活节制，保持健康。总体寿命预测在78-85岁，适度节制对长寿至关重要。"  
        }  
    },  
    "61": {  
        "name": "中孚",  
        "hexagram": "☴☵",  
        "chinese_name": "中孚",  
        "english_name": "Inner Truth",  
        "image": "中孚：豚鱼吉，利涉大川，利贞。",  
        "judgment": "中孚：豚鱼吉，利涉大川，利贞。",  
        "image_comment": "泽上有风，中孚；君子以议狱缓死。",  
        "lines": {  
            "初九": "初九：虞吉，有它不燕。",  
            "九二": "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。",  
            "六三": "六三：得敌，或鼓或罢，或泣或歌。",  
            "六四": "六四：月几望，马匹亡，无咎。",  
            "九五": "九五：有孚挛如，无咎。",  
            "上九": "上九：翰音登于天，贞凶。"  
        },  
        "interpretation": {  
            "fortune": "中孚卦象征诚信中正，真诚相待。时运方面显示您当前诚信为本，人际关系良好。建议保持真诚态度，建立信任关系。未来半年内，真诚将为您赢得广泛支持。总体运势为大吉，关键在于诚信为本，真诚待人，才能获得长久的人际支持和事业成功。",  
            "wealth": "财运亨通，诚信经营成功。中孚卦主诚信，预示通过诚信经营获得商业信任和长期合作。建议建立诚信的商业信誉，获得客户信任。近期可能通过诚信获得大单合作。未来一年内，财运指数82分，诚信是获得财富增长的关键。",  
            "career": "工作顺利，诚信赢得信任。中孚卦象征诚信，预示职场中您的诚信态度将获得领导和同事高度信任。建议保持专业诚信，积极承担责任。领导器重诚信员工。未来一年内，职业运势极佳，可能获得重要职位和信任项目。",  
            "marriage": "感情真诚，信任基础深厚。中孚卦主诚信，预示感情关系建立在真诚信任基础上。单身者宜展现诚信可靠的一面。已婚者夫妻感情深厚，互相信任。建议保持真诚沟通，避免猜疑。未来两年内，婚姻运势极佳，信任是基础。",  
            "health": "身体状况良好，诚信生活有益。中孚卦象征诚信，预示真诚平和的心态对健康有积极影响。建议保持诚信的生活态度，避免心理负担。适当进行放松活动，保持身心健康。诚信的人际关系缓解心理压力。未来一年内，健康运势良好。",  
            "lifespan": "寿命较长，诚信生活有益。中孚卦主诚信中正，预示真诚平和的生活态度有助于健康长寿。建议保持诚信的人际关系，获得社会支持。60岁以后诚信的社交网络对健康至关重要。总体寿命预测在80-87岁，诚信生活有助于长寿。"  
        }  
    },  
    "62": {  
        "name": "小过",  
        "hexagram": "☳☱",  
        "chinese_name": "小过",  
        "english_name": "Preponderance of the Small",  
        "image": "小过：亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上，宜下，大吉。",  
        "judgment": "小过：亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上，宜下，大吉。",  
        "image_comment": "山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。",  
        "lines": {  
            "初六": "初六：飞鸟以凶。",  
            "六二": "六二：过其祖母，初为艰，自二贞吉。",  
            "九三": "九三：弗过防之，从或戕之，凶。",  
            "六四": "六四：无咎，弗过遇之，往厉必戒，勿用永贞。",  
            "六五": "六五：密云不雨，自我西郊，公弋取彼在穴。",  
            "上六": "上六：过涉灭顶，凶，无咎。"  
        },  
        "interpretation": {  
            "fortune": "小过卦象征小有过失，需谨慎处理。时运方面显示您当前可能出现小错误，需要及时纠正。建议关注细节，避免小失大。未来半年内，小问题需要及时处理。总体运势为中吉，关键在于防微杜渐，及时纠正小错误，才能避免酿成大祸，保持稳定发展。",  
            "wealth": "财运一般，注意小额损失。小过卦主小过，预示可能出现小额财务错误或损失。建议仔细审查财务细节，避免小错误造成损失。近期关注日常开支，避免不必要支出。未来一年内，财运指数60分，注意防范小额财务风险。",  
            "career": "工作中有小失误，需要注意。 小过卦象征小过，预示工作中可能出现小错误或疏忽。建议加强细节管理，提高工作质量。领导关注员工的细心程度。未来一年内，职业运势一般，需要注意工作细节，避免小错误影响整体表现。",  
            "marriage": "感情关系中有小摩擦，需要及时处理。小过卦主小过，预示夫妻间可能出现小矛盾或误会。单身者注意小细节，避免因小事失去机会。已婚者需及时沟通，避免小问题积累。建议关注日常小事，及时化解矛盾。未来两年内，婚姻运势需要注意小节。",  
            "health": "身体状况一般，注意小病防治。小过卦象征小过，预示可能出现小病小痛，需要及时处理。建议关注身体小信号，及时就医。保持良好卫生习惯，预防小病。注意饮食细节，避免食物中毒。未来一年内，健康运势一般，需注意小病防治。",  
            "lifespan": "寿命中等，注意小病积累。小过卦主小错误，预示小病如果不及时处理可能积累成大病。建议重视早期治疗，建立定期体检制度。60岁以前需养成及时就医的习惯。总体寿命预测在72-79岁，通过及时治疗可避免小病影响寿命。"  
        }  
    },  
    "63": {  
        "name": "既济",  
        "hexagram": "☲☵",  
        "chinese_name": "既济",  
        "english_name": "After Completion",  
        "image": "既济：亨小，利贞，初吉终乱。",  
        "judgment": "既济：亨小，利贞，初吉终乱。",  
        "image_comment": "水在火上，既济；君子以思患而豫防之。",  
        "lines": {  
            "初九": "初九：曳其轮，濡其尾，无咎。",  
            "六二": "六二：妇丧其茀，勿逐，七日得。",  
            "九三": "九三：高宗伐鬼方，三年克之，小人勿用。",  
            "六四": "六四：绞里，终成，贞吉，无咎。",  
            "九五": "九五：东邻杀牛，不如西邻之禴祭，实受其福。",  
            "上六": "上六：濡其首，厉。"  
        },  
        "interpretation": {  
            "fortune": "既济卦象征已经完成，需警惕懈怠。时运方面显示您当前处于成功之后，需要保持警惕，避免松懈。建议巩固成果，防患未然。未来半年内，成功后需保持紧张感。总体运势为中吉，关键在于成功之后更加谨慎，防范衰败，才能保持长久的成功和稳定发展。",  
            "wealth": "财运稳定，需要巩固成果。既济卦主完成，预示财务状况良好，但需防止松懈导致损失。建议巩固现有投资，完善理财规划。近期财运稳定，适合财富保值。未来一年内，财运指数75分，成功后需保持谨慎，避免财富流失。",  
            "career": "职业成功，需要保持警惕。既济卦象征完成，预示职场中获得成功，但需防止骄傲自满。建议继续保持高标准工作，巩固现有地位。领导关注员工的持续表现。未来一年内，职业运势良好，但需保持努力，避免因成功而懈怠。",  
            "marriage": "婚姻稳定，需保持热情。既济卦主完成，预示婚姻关系稳定，但需防止感情冷却。单身者成功获得美满婚姻。已婚者家庭生活幸福，需保持夫妻热情。建议避免因稳定而忽视对方感受。未来两年内，婚姻运势良好，需用心经营。",  
            "health": "身体状况良好，需保持养生。既济卦象征完成，预示健康状况稳定，但成功后易松懈。建议继续保持健康习惯，避免因成功而放纵。定期体检，巩固健康基础。保持良好心态，避免过度劳累。未来一年内，健康运势稳定，需持续关注。",  
            "lifespan": "寿命较长，需保持养生习惯。既济卦主完成之后，预示通过持续养生可以保持健康长寿。建议在健康状况良好时继续坚持养生习惯。60岁以后需更加重视养生，避免因稳定而松懈。总体寿命预测在78-85岁，持续养生是关键。"  
        }  
    },  
    "64": {  
        "name": "未济",  
        "hexagram": "☵☲",  
        "chinese_name": "未济",  
        "english_name": "Before Completion",  
        "image": "未济：亨，小狐汔济，未出中流，濡其尾，无攸利。",  
        "judgment": "未济：亨，小狐汔济，未出中流，濡其尾，无攸利。",  
        "image_comment": "火在水上，未济；君子以慎辨物居方。",  
        "lines": {  
            "初六": "初六：濡其尾，吝。",  
            "九二": "九二：曳其轮，贞吉。",  
            "六三": "六三：未济，征凶，利涉大川。",  
            "九四": "九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。",  
            "六五": "六五：贞吉，无悔，君子之光，有孚，吉。",  
            "上九": "上九：有孚于饮酒，无咎，濡其首，有孚失是。"  
        },  
        "interpretation": {  
            "fortune": "未济卦象征未完成，尚待努力。时运方面显示您当前处于事业接近成功但尚未完成的关键阶段。建议继续努力，坚持到底。未来半年内，需要最后的冲刺。总体运势为中上，关键在于坚持不懈，完成最后阶段的努力，才能获得最终的成功和圆满结局。",  
            "wealth": "财运接近成功，需要最后努力。未济卦主未完成，预示财务目标接近实现，但需继续努力。建议坚持现有投资策略，完成理财计划。近期可能需要追加投资完成项目。未来一年内，财运指数78分，坚持到底将获得丰厚回报。",  
            "career": "职业接近成功，坚持到底。未济卦象征未完成，预示职场目标即将实现，需要最后努力。建议全力以赴，完成重要项目。领导期待最终成果。未来一年内，职业运势良好，坚持努力将获得晋升和成功认可。",  
            "marriage": "感情接近圆满，需要最后努力。未济卦主未完成，预示感情关系即将稳定，需要最后的沟通和努力。单身者接近成功获得真爱。已婚者婚姻即将圆满，需解决最后问题。建议坚持努力，完成感情建设。未来两年内，婚姻运势良好。",  
            "health": "身体状况良好，最后调理关键。未济卦象征未完成，预示健康调理接近完成，需要坚持最后阶段。建议继续保持健康习惯，完成养生计划。巩固健康成果，避免前功尽弃。保持良好心态，坚持到底。未来一年内，健康运势良好，坚持是关键。",  
            "lifespan": "寿命较长，坚持养生重要。未济卦主未完成，预示通过持续不断的养生努力可以获得健康长寿。建议坚持长期养生计划，完成健康目标。60岁以后继续保持养生习惯。总体寿命预测在78-85岁，坚持养生是获得长寿的关键。"  
        }  
    }  
}  

